--
-- PostgreSQL database cluster dump
--

\restrict 0PFaPgcW54Qjw8EjjJZbTZzs6s2j7iFNK0gE1I3zoFofb1lwAnasaK1viuuP3rA

SET default_transaction_read_only = off;

SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;

--
-- Drop databases (except postgres and template1)
--

DROP DATABASE root;




--
-- Drop roles
--

DROP ROLE root;


--
-- Roles
--

CREATE ROLE root;
ALTER ROLE root WITH SUPERUSER INHERIT CREATEROLE CREATEDB LOGIN REPLICATION BYPASSRLS PASSWORD 'SCRAM-SHA-256$4096:UJdI0Va4CsvSmVKqdu7XZA==$iqS0uphCwcJE4kBeRR9dw1y7XqH9NZHLMQPy3aXIDME=:O9bHs4mjcjWHe6LuJq/ZqSPKurea5bQS+8WzJXpT0bY=';






\unrestrict 0PFaPgcW54Qjw8EjjJZbTZzs6s2j7iFNK0gE1I3zoFofb1lwAnasaK1viuuP3rA

--
-- Databases
--

--
-- Database "template1" dump
--

--
-- PostgreSQL database dump
--

\restrict MdyVOiYHuzXLlaLSS1K11bzFht1z4grCf7gpZXCT358CB6gMebWfb5ty81yMgbX

-- Dumped from database version 14.23
-- Dumped by pg_dump version 14.23

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

UPDATE pg_catalog.pg_database SET datistemplate = false WHERE datname = 'template1';
DROP DATABASE template1;
--
-- Name: template1; Type: DATABASE; Schema: -; Owner: root
--

CREATE DATABASE template1 WITH TEMPLATE = template0 ENCODING = 'UTF8' LOCALE = 'en_US.utf8';


ALTER DATABASE template1 OWNER TO root;

\unrestrict MdyVOiYHuzXLlaLSS1K11bzFht1z4grCf7gpZXCT358CB6gMebWfb5ty81yMgbX
\connect template1
\restrict MdyVOiYHuzXLlaLSS1K11bzFht1z4grCf7gpZXCT358CB6gMebWfb5ty81yMgbX

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Name: DATABASE template1; Type: COMMENT; Schema: -; Owner: root
--

COMMENT ON DATABASE template1 IS 'default template for new databases';


--
-- Name: template1; Type: DATABASE PROPERTIES; Schema: -; Owner: root
--

ALTER DATABASE template1 IS_TEMPLATE = true;


\unrestrict MdyVOiYHuzXLlaLSS1K11bzFht1z4grCf7gpZXCT358CB6gMebWfb5ty81yMgbX
\connect template1
\restrict MdyVOiYHuzXLlaLSS1K11bzFht1z4grCf7gpZXCT358CB6gMebWfb5ty81yMgbX

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Name: DATABASE template1; Type: ACL; Schema: -; Owner: root
--

REVOKE CONNECT,TEMPORARY ON DATABASE template1 FROM PUBLIC;
GRANT CONNECT ON DATABASE template1 TO PUBLIC;


--
-- PostgreSQL database dump complete
--

\unrestrict MdyVOiYHuzXLlaLSS1K11bzFht1z4grCf7gpZXCT358CB6gMebWfb5ty81yMgbX

--
-- Database "postgres" dump
--

--
-- PostgreSQL database dump
--

\restrict pryhRZchLWn5Jqp4afwC5wsaElgaLgmZVQ5V083939wgfyaK1IpYbNsvihkgfTN

-- Dumped from database version 14.23
-- Dumped by pg_dump version 14.23

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

DROP DATABASE postgres;
--
-- Name: postgres; Type: DATABASE; Schema: -; Owner: root
--

CREATE DATABASE postgres WITH TEMPLATE = template0 ENCODING = 'UTF8' LOCALE = 'en_US.utf8';


ALTER DATABASE postgres OWNER TO root;

\unrestrict pryhRZchLWn5Jqp4afwC5wsaElgaLgmZVQ5V083939wgfyaK1IpYbNsvihkgfTN
\connect postgres
\restrict pryhRZchLWn5Jqp4afwC5wsaElgaLgmZVQ5V083939wgfyaK1IpYbNsvihkgfTN

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Name: DATABASE postgres; Type: COMMENT; Schema: -; Owner: root
--

COMMENT ON DATABASE postgres IS 'default administrative connection database';


SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: customer; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.customer (
    id integer NOT NULL,
    login character varying(50) NOT NULL,
    password character varying(255) NOT NULL,
    email character varying(50) NOT NULL,
    user_role character varying(50) DEFAULT 'ordinary'::character varying NOT NULL,
    registration_date timestamp without time zone DEFAULT CURRENT_TIMESTAMP
);


ALTER TABLE public.customer OWNER TO root;

--
-- Name: customer_delivery_info; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.customer_delivery_info (
    id integer,
    phone_number text,
    city text,
    address text
);


ALTER TABLE public.customer_delivery_info OWNER TO root;

--
-- Name: customer_id_seq; Type: SEQUENCE; Schema: public; Owner: root
--

CREATE SEQUENCE public.customer_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.customer_id_seq OWNER TO root;

--
-- Name: customer_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: root
--

ALTER SEQUENCE public.customer_id_seq OWNED BY public.customer.id;


--
-- Name: customer_item; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.customer_item (
    item_id integer,
    count integer,
    customer_id integer,
    props jsonb
);


ALTER TABLE public.customer_item OWNER TO root;

--
-- Name: customer_personal_info; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.customer_personal_info (
    id integer,
    company text,
    first_name text,
    second_name text
);


ALTER TABLE public.customer_personal_info OWNER TO root;

--
-- Name: item; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.item (
    id integer NOT NULL,
    name text NOT NULL,
    price integer,
    item_type text NOT NULL,
    secondary_type text NOT NULL,
    item_picture text,
    item_description text NOT NULL,
    item_short_description text NOT NULL,
    article integer,
    visible boolean DEFAULT false NOT NULL
);


ALTER TABLE public.item OWNER TO root;

--
-- Name: item_id_seq; Type: SEQUENCE; Schema: public; Owner: root
--

CREATE SEQUENCE public.item_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.item_id_seq OWNER TO root;

--
-- Name: item_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: root
--

ALTER SEQUENCE public.item_id_seq OWNED BY public.item.id;


--
-- Name: item_properties; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.item_properties (
    id integer NOT NULL,
    name text NOT NULL
);


ALTER TABLE public.item_properties OWNER TO root;

--
-- Name: item_properties_id_seq; Type: SEQUENCE; Schema: public; Owner: root
--

CREATE SEQUENCE public.item_properties_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.item_properties_id_seq OWNER TO root;

--
-- Name: item_properties_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: root
--

ALTER SEQUENCE public.item_properties_id_seq OWNED BY public.item_properties.id;


--
-- Name: item_properties_values; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.item_properties_values (
    item_id integer NOT NULL,
    property_id integer NOT NULL,
    value character varying(500) NOT NULL
);


ALTER TABLE public.item_properties_values OWNER TO root;

--
-- Name: item_spec_files; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.item_spec_files (
    id integer NOT NULL,
    name text NOT NULL,
    link text NOT NULL,
    picture text NOT NULL
);


ALTER TABLE public.item_spec_files OWNER TO root;

--
-- Name: schema_migrations; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.schema_migrations (
    version bigint NOT NULL,
    dirty boolean NOT NULL
);


ALTER TABLE public.schema_migrations OWNER TO root;

--
-- Name: spec; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.spec (
    id integer NOT NULL,
    item_id integer,
    item_patch text NOT NULL,
    name text NOT NULL
);


ALTER TABLE public.spec OWNER TO root;

--
-- Name: spec_id_seq; Type: SEQUENCE; Schema: public; Owner: root
--

CREATE SEQUENCE public.spec_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.spec_id_seq OWNER TO root;

--
-- Name: spec_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: root
--

ALTER SEQUENCE public.spec_id_seq OWNED BY public.spec.id;


--
-- Name: user_applications; Type: TABLE; Schema: public; Owner: root
--

CREATE TABLE public.user_applications (
    id integer NOT NULL,
    user_id integer NOT NULL,
    email character varying(50) NOT NULL,
    first_name character varying(30) NOT NULL,
    second_name character varying(30) NOT NULL,
    login character varying(30) NOT NULL,
    phone_number character varying(30) NOT NULL,
    company character varying(50) NOT NULL,
    address character varying(80) NOT NULL,
    city character varying(30) NOT NULL,
    order_date date,
    items jsonb,
    order_status character varying(20) DEFAULT '╨Т ╨╛╨▒╤А╨░╨▒╨╛╤В╨║╨╡'::character varying NOT NULL
);


ALTER TABLE public.user_applications OWNER TO root;

--
-- Name: user_applications_id_seq; Type: SEQUENCE; Schema: public; Owner: root
--

CREATE SEQUENCE public.user_applications_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.user_applications_id_seq OWNER TO root;

--
-- Name: user_applications_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: root
--

ALTER SEQUENCE public.user_applications_id_seq OWNED BY public.user_applications.id;


--
-- Name: customer id; Type: DEFAULT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.customer ALTER COLUMN id SET DEFAULT nextval('public.customer_id_seq'::regclass);


--
-- Name: item id; Type: DEFAULT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item ALTER COLUMN id SET DEFAULT nextval('public.item_id_seq'::regclass);


--
-- Name: item_properties id; Type: DEFAULT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item_properties ALTER COLUMN id SET DEFAULT nextval('public.item_properties_id_seq'::regclass);


--
-- Name: spec id; Type: DEFAULT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.spec ALTER COLUMN id SET DEFAULT nextval('public.spec_id_seq'::regclass);


--
-- Name: user_applications id; Type: DEFAULT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.user_applications ALTER COLUMN id SET DEFAULT nextval('public.user_applications_id_seq'::regclass);


--
-- Data for Name: customer; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.customer (id, login, password, email, user_role, registration_date) FROM stdin;
2	AdminUser	$2a$12$Ve.w2S.3WxHYObTfeFiP8uQjku5rkeoJvLOSeh8btunIFlL2nwot6	testUser@gmail.com	admin	2026-07-01 07:37:26.070058
3	PrimaryUser	$2a$12$h4EUVhThodORLKEqoX7Ske6GTLBqVEDiCNXbcU2OI2wdbeqX.umX.	PrimaryUser@gmail.com	ordinary	2026-07-01 07:38:23.789422
\.


--
-- Data for Name: customer_delivery_info; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.customer_delivery_info (id, phone_number, city, address) FROM stdin;
\.


--
-- Data for Name: customer_item; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.customer_item (item_id, count, customer_id, props) FROM stdin;
5	4	3	{"╨Т╨╖╤А╤Л╨▓╨╛╨╖╨░╤Й╨╕╤В╨░": "1 Exd IIC T5 Gb X", "╨Я╨╛╨│╤А╨╡╤И╨╜╨╛╤Б╤В╤М, %": "0...+100", "╨Я╤Л╨╗╨╡╨▓╨╗╨░╨│╨╛╨╖╨░╤Й╨╕╤В╨░": "IP 66/68", "╨б╨┐╨╡╤Ж. ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╨╡": "╨б╨╡╤А╨╛╨▓╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡", "╨Т╤Л╤Е╨╛╨┤╨╜╤Л╨╡ ╤Б╨╕╨│╨╜╨░╨╗╤Л": " ╨ж╨╕╤Д╤А╨╛╨▓╨╛╨╣: RS-485 ╤Б ╨┐╤А╨╛╤В╨╛╨║╨╛╨╗╨╛╨╝ Modbus RTU", "╨Ш╨╖╨╝╨╡╤А╤П╨╡╨╝╨░╤П ╤Б╤А╨╡╨┤╨░": "╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М", "╨Э╨░╨┐╤А╤П╨╢╨╡╨╜╨╕╨╡ ╨┐╨╕╤В╨░╨╜╨╕╤П, ╨Т": " ┬▒1.5", "╨Ь╨╡╨╢╨┐╨╛╨▓╨╡╤А╨╛╤З╨╜╤Л╨╣ ╨╕╨╜╤В╨╡╤А╨▓╨░╨╗": "4 ╨│╨╛╨┤╨░", "╨Ф╨╕╨░╨╝╨╡╤В╤А ╤Г╤Б╨╗╨╛╨▓╨╜╨╛╨│╨╛ ╨┐╤А╨╛╤Е╨╛╨┤╨░, ╨╝╨╝": " 100", "╨в╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л, ┬░╨б": "-60...+70", "╨в╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░ ╨╛╨║╤А╤Г╨╢╨░╤О╤Й╨╡╨╣ ╤Б╤А╨╡╨┤╤Л, ┬░╨б": "-60...+70"}
\.


--
-- Data for Name: customer_personal_info; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.customer_personal_info (id, company, first_name, second_name) FROM stdin;
\.


--
-- Data for Name: item; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.item (id, name, price, item_type, secondary_type, item_picture, item_description, item_short_description, article, visible) FROM stdin;
1	╨Ь╨Ч╨Ь-╨Ф╨Ф1 ╨Ф╨╕╤Д╤Д╨╡╤А╨╡╨╜╤Ж╨╕╨░╨╗╤М╨╜╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П	30000	╨Ф╨░╤В╤З╨╕╨║ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П	╨Ф╨╕╤Д╤Д╨╡╤А╨╡╨╜╤Ж╨╕╨░╨╗╤М╨╜╨╛╨╡ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡	╨Ф╨░╤В╤З╨╕╨║ ╨┤╨╕╤Д╤Д╨╡╤А╨╡╨╜╤Ж╨╕╨░╨╗╤М╨╜╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П.png	╨Ф╨░╨╜╨╜╤Л╨╡ ╨┐╤А╨╕╨▒╨╛╤А╤Л ╨╕╨╖╨╝╨╡╤А╤П╤О╤В ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡ ╨▓ ╤В╤А╤Г╨▒╨░╤Е, ╤Б╨╛╤Б╤Г╨┤╨░╤Е, ╨░╨┐╨┐╨░╤А╨░╤В╨░╤Е, ╨┐╨░╤А╨╛╨▓╤Л╤Е ╨╕ ╨▓╨╛╨┤╨╛╨│╤А╨╡╨╣╨╜╤Л╤Е ╨║╨╛╤В╨╗╨░╤Е, ╨▓ ╨║╨░╤З╨╡╤Б╤В╨▓╨╡ ╤В╨╛╤З╨║╨╕ ╨╛╤В╤Б╤З╨╡╤В╨░ ╨┐╤А╨╕ ╤Н╤В╨╛╨╝ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╤В╤Б╤П ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╤А╨░╨▓╨╜╨╛╨│╨╛ ╨░╨▒╤Б╨╛╨╗╤О╤В╨╜╨╛╨╝╤Г ╨╜╤Г╨╗╤О. ╨Ю╨▒╨╡╤Б╨┐╨╡╤З╨╕╨▓╨░╨╡╤В╤Б╤П ╤В╨░╨║╨╛╨╡ ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╨╡ ╨╜╨░╨╗╨╕╤З╨╕╨╡╨╝ ╤Б╨┐╨╡╤Ж╨╕╨░╨╗╤М╨╜╨╛╨╣ ╨║╨░╨╝╨╡╤А╤Л, ╨╕╨╖ ╨║╨╛╤В╨╛╤А╨╛╨╣ ╨┐╤А╨╕ ╨╕╨╖╨│╨╛╤В╨╛╨▓╨╗╨╡╨╜╨╕╨╕ ╨┐╤А╨╕╨▒╨╛╤А╨░ ╨╛╤В╨║╨░╤З╨╕╨▓╨░╨╡╤В╤Б╤П ╨▓╨╛╨╖╨┤╤Г╤Е. ╨н╤В╨░ ╨║╨░╨╝╨╡╤А╨░ ╤А╨░╤Б╨┐╨╛╨╗╨░╨│╨░╨╡╤В╤Б╤П ╨▓ ╨┐╨╛╨╗╨╛╤Б╤В╨╕ ╤Б╨╡╨╜╤Б╨╛╤А╨░, ╨░ ╤Б ╨┤╤А╤Г╨│╨╛╨╣ ╤Б╤В╨╛╤А╨╛╨╜╤Л ╨╜╨░ ╤З╤Г╨▓╤Б╤В╨▓╨╕╤В╨╡╨╗╤М╨╜╤Л╨╣ ╤Н╨╗╨╡╨╝╨╡╨╜╤В ╨▓╨╛╨╖╨┤╨╡╨╣╤Б╤В╨▓╤Г╨╡╤В ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л. ╨н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╤Л╨╣ ╨▒╨╗╨╛╨║ ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В ╤А╨░╤Б╤З╨╡╤В ╨╕ ╨▓╤Л╨▓╨╛╨┤╨╕╤В ╨┐╨╛╨╗╤Г╤З╨╡╨╜╨╜╨╛╨╡ ╨╖╨╜╨░╤З╨╡╨╜╨╕╨╡ ╨╜╨░ ╨┤╨╕╤Б╨┐╨╗╨╡╨╣ ╨╕╨╗╨╕ ╨┐╨╡╤А╨╡╨┤╨░╨╡╤В ╤Б ╨┐╨╛╨╝╨╛╤Й╤М╤О ╨▓╤Л╤Е╨╛╨┤╨╜╤Л╤Е ╤Б╨╕╨│╨╜╨░╨╗╨╛╨▓.\r\n\r\n╨з╤Г╨▓╤Б╤В╨▓╨╕╤В╨╡╨╗╤М╨╜╤Л╨╝ ╤Н╨╗╨╡╨╝╨╡╨╜╤В╨╛╨╝ ╤Б╨╗╤Г╨╢╨╕╤В ╨╝╨╛╨╜╨╛╨║╤А╨╕╤Б╤В╨░╨╗╨╗╨╕╤З╨╡╤Б╨║╨░╤П ╨║╤А╨╡╨╝╨╜╨╕╨╡╨▓╨░╤П ╨╝╨╡╨╝╨▒╤А╨░╨╜╨░, ╨╜╨░ ╨║╨╛╤В╨╛╤А╨╛╨╣ ╤А╨░╤Б╨┐╨╛╨╗╨╛╨╢╨╡╨╜ ╨╝╨╛╤Б╤В ╨г╨╕╤В╤Б╤В╨╛╨╜╨░, ╨┐╨╗╨╡╤З╨╕ ╨╝╨╛╤Б╤В╨░ - ╨┐╤М╨╡╨╖╨╛╤А╨╡╨╖╨╕╤Б╤В╨╛╤А╤Л. ╨Ф╨╗╤П ╨╖╨░╤Й╨╕╤В╤Л ╤Б╨╡╨╜╤Б╨╛╤А╨░ ╨╛╤В ╨▓╨╛╨╖╨┤╨╡╨╣╤Б╤В╨▓╨╕╤П ╨░╨│╤А╨╡╤Б╤Б╨╕╨▓╨╜╨╛╨╣ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╨╕ ╨╛╨║╤А╤Г╨╢╨░╤О╤Й╨╕╤Е ╤Б╤А╨╡╨┤, ╨▓ ╨╛╤В╨┤╨╡╨╗╤М╨╜╤Л╤Е ╨╝╨╛╨┤╨╕╤Д╨╕╨║╨░╤Ж╨╕╤П╤Е ╨┐╤А╨╡╨┤╤Г╤Б╨╝╨╛╤В╤А╨╡╨╜╤Л ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╤М╨╜╤Л╨╡ ╨╝╨╡╨╝╨▒╤А╨░╨╜╤Л ╨╕ ╨╖╨░╨┐╨╛╨╗╨╜╤П╤О╤Й╨░╤П ╨╢╨╕╨┤╨║╨╛╤Б╤В╤М. ╨Я╤А╨╕ ╤Н╤В╨╛╨╝ ╨╡╤Б╤В╤М ╨▓╨╛╨╖╨╝╨╛╨╢╨╜╨╛╤Б╤В╤М ╨▓╤Л╨▒╤А╨░╤В╤М ╤В╨╕╨┐ ╨╖╨░╨┐╨╛╨╗╨╜╤П╤О╤Й╨╡╨╣ ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╕ ╨╕ ╨╝╨░╤В╨╡╤А╨╕╨░╨╗╤Л ╨╝╨╡╨╝╨▒╤А╨░╨╜╤Л. ╨Т ╤А╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╡ ╨┐╨╛ ╤Н╨║╤Б╨┐╨╗╤Г╨░╤В╨░╤Ж╨╕╨╕ ╨┐╤А╨╛╨┐╨╕╤Б╨░╨╜╤Л ╨▓╤Б╨╡ ╨▓╨░╤А╨╕╨░╨╜╤В╤Л ╨╕╨╖╨│╨╛╤В╨╛╨▓╨╗╨╡╨╜╨╕╤П, ╨▓ ╤В╨╛╨╝ ╤З╨╕╤Б╨╗╨╡ ╤Н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╨╛╨│╨╛ ╨▒╨╗╨╛╨║╨░ ╨╕ ╨║╨╛╤А╨┐╤Г╤Б╨░ ╨┐╤А╨╕╨▒╨╛╤А╨╛╨▓ ╤Б ╤Г╤З╨╡╤В╨╛╨╝ ╤Г╤Б╨╗╨╛╨▓╨╕╨╣ ╤Н╨║╤Б╨┐╨╗╤Г╨░╤В╨░╤Ж╨╕╨╕.	╨Ш╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П: ╤И╤В╤Г╤Ж╨╡╤А╨╜╨╛╨╡, ╤Б ╨╛╤В╨║╤А╤Л╤В╨╛╨╣ ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╤М╨╜╨╛╨╣ ╨╝╨╡╨╝╨▒╤А╨░╨╜╨╜╨╛╨╣ ╨╕╨╗╨╕ ╨▓╤Л╨╜╨╛╤Б╨╜╨╛╨╣ ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╤М╨╜╨╛╨╣ ╨╝╨╡╨╝╨▒╤А╨░╨╜╨╛╨╣, ╤Б ╤В╤А╨░╨┤╨╕╤Ж╨╕╨╛╨╜╨╜╤Л╨╝ ╤Д╨╗╨░╨╜╤Ж╨╡╨▓╤Л╨╝ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡╨╝ ╨┐╨╛ ╤Б╤В╨░╨╜╨┤╨░╤А╤В╨░╨╝ EN 61518: IEC 61518. ╨Ф╨╕╨░╨┐╨░╨╖╨╛╨╜ ╨╜╨░╤Б╤В╤А╨░╨╕╨▓╨░╨╡╨╝╨╛╨│╨╛ ╨▓╨╡╤А╤Е╨╜╨╡╨│╨╛ ╨┐╤А╨╡╨┤╨╡╨╗╨░ ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П (╨Т╨Я╨Ш) 500 ╨Я╨░ ╨┤╨╛ 40 ╨Ь╨Я╨░. ╨Я╨╡╤А╨╡╨╜╨░╤Б╤В╤А╨╛╨╣╨║╨░ ╨┤╨╕╨░╨┐╨░╨╖╨╛╨╜╨░ ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П 100:1, ╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░ ╤Б╤А╨╡╨┤╤Л ╨┤╨╛ 230 ┬║C, ╤Б╨░╨╝╨╛╨┤╨╕╨░╨│╨╜╨╛╤Б╤В╨╕╨║╨░ NAMUR NE107, ╤Б╨╛╨╛╤В╨▓╨╡╤В╤Б╤В╨▓╨╕╨╡ ╤В╤А╨╡╨▒╨╛╨▓╨░╨╜╨╕╤П╨╝ ╤Д╤Г╨╜╨║╤Ж╨╕╨╛╨╜╨░╨╗╤М╨╜╨╛╨╣ ╨▒╨╡╨╖╨╛╨┐╨░╤Б╨╜╨╛╤Б╤В╨╕ SIL2.	9823	t
3	╨Ь╨Ч╨Ь-╨Ш╨Ф-1 ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П	35000	╨Ф╨░╤В╤З╨╕╨║ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П	╨Ш╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╨╡ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡	╨Ф╨░╤В╤З╨╕╨║ ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П.png	╨Ф╨░╤В╤З╨╕╨║╨╕ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П 4-20 ╨╝╨Р ╨╝╨╛╨│╤Г╤В ╨╕╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╤В╤М╤Б╤П ╨▓ ╤Б╨╕╤Б╤В╨╡╨╝╨░╤Е ╨░╨▓╤В╨╛╨╝╨░╤В╨╕╤З╨╡╤Б╨║╨╛╨│╨╛ ╨║╨╛╨╜╤В╤А╨╛╨╗╤П, ╤А╨╡╨│╤Г╨╗╨╕╤А╨╛╨▓╨░╨╜╨╕╤П ╨╕ ╤Г╨┐╤А╨░╨▓╨╗╨╡╨╜╨╕╤П ╤В╨╡╤Е╨╜╨╛╨╗╨╛╨│╨╕╤З╨╡╤Б╨║╨╕╨╝╨╕ ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨░╨╝╨╕ ╨▓ ╤З╨╡╤А╨╜╨╛╨╣ ╨╕ ╤Ж╨▓╨╡╤В╨╜╨╛╨╣ ╨╝╨╡╤В╨░╨╗╨╗╤Г╤А╨│╨╕╨╕, ╨╜╨╡╤Д╤В╨╡╨┐╨╡╤А╨╡╤А╨░╨▒╨╛╤В╨║╨╡ ╨╕ ╨│╨░╨╖╨╛╨┐╨╡╤А╨╡╤А╨░╨▒╨╛╤В╨║╨╡, ╨┤╨╛╨▒╤Л╤З╨░ ╨╜╨╡╤Д╤В╨╕ ╨│╨░╨╖╨░, ╤Е╨╕╨╝╨╕╤З╨╡╤Б╨║╨╛╨╣ ╨╛╤В╤А╨░╤Б╨╗╨╕ ╨╕ ╨┐╨╕╤Й╨╡╨▓╨╛╨╣ ╨╛╤В╤А╨░╤Б╨╗╨╕. ╨в╨░╨║╨╢╨╡ ╨┤╨░╤В╤З╨╕╨║╨╕ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╨н╨Ь╨Ш╨б-╨С╨Р╨а ╤Г╤Б╨┐╨╡╤И╨╜╨╛ ╨┐╤А╨╕╨╝╨╡╨╜╤П╤О╤В╤Б╤П ╨╜╨░ ╤А╤Г╨┤╨╜╨╕╨║╨░╤Е ╨╕ ╨╝╨╛╤А╤Б╨║╨╕╤Е ╨┐╨╗╨░╤В╤Д╨╛╤А╨╝╨░╤Е ╨╕ ╤Б╤Г╨┤╨░╤Е.\r\n\r\n╨Я╤А╨╡╨┤╤Б╤В╨░╨▓╨╗╤П╤О╤В ╤Б╨╛╨▒╨╛╨╣ ╤Б╨╛╤З╨╡╤В╨░╨╜╨╕╨╡ ╨┐╤А╨╡╨╛╨▒╤А╨░╨╖╨╛╨▓╨░╤В╨╡╨╗╨╡╨╣ ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╨│╨╛ ╨╕ ╨▓╨░╨║╤Г╤Г╨╝╨╝╨╡╤В╤А╨╕╤З╨╡╤Б╨║╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╣, ╤В.╨╡. ╨╕╨╖╨╝╨╡╤А╤П╤О╤В ╨║╨░╨║ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡, ╤В╨░╨║ ╨╕ ╤А╨░╨╖╤А╨╡╨╢╨╡╨╜╨╕╨╡.\r\n\r\n╨Ф╨░╤В╤З╨╕╨║╨╕ ╨Ь╨Ч╨Ь ╨┤╨╗╤П ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╨┐╤А╨╕╨╝╨╡╨╜╤П╤О╤В╤Б╤П ╨▓ ╤Б╨╕╤Б╤В╨╡╨╝╨░╤Е ╨║╨╛╨╝╨╝╨╡╤А╤З╨╡╤Б╨║╨╛╨│╨╛ ╤Г╤З╨╡╤В╨░ ╨┤╨╗╤П ╨║╨╛╨╝╨┐╨╡╨╜╤Б╨░╤Ж╨╕╨╕ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л ╨┐╤А╨╕ ╨┐╤А╨╕╨▓╨╡╨┤╨╡╨╜╨╕╨╕ ╨╖╨╜╨░╤З╨╡╨╜╨╕╤П ╤А╨░╤Б╤Е╨╛╨┤╨░ ╨║ ╤Б╤В╨░╨╜╨┤╨░╤А╤В╨╜╤Л╨╝ ╨╕╨╗╨╕ ╨╜╨╛╤А╨╝╨░╨╗╤М╨╜╤Л╨╝ ╤Г╤Б╨╗╨╛╨▓╨╕╤П╨╝.\r\n\r\n╨Т ╤Н╨╜╨╡╤А╨│╨╡╤В╨╕╨║╨╡ ╨┤╨░╨╜╨╜╤Л╨╣ ╤В╨╕╨┐ ╨┐╤А╨╕╨▒╨╛╤А╨╛╨▓ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╤В╤Б╤П ╨┤╨╗╤П ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╨┐╨░╤А╨░, ╨▓╨╛╨┤╤Л, ╨│╨░╨╖╨░ ╨╕ ╨┤╤А╤Г╨│╨╕╤Е ╤А╨░╨▒╨╛╤З╨╕╤Е ╤Б╤А╨╡╨┤ ╨▓ ╨║╨╛╤В╨╗╨░╤Е, ╤В╤Г╤А╨▒╨╕╨╜╨░╤Е, ╤В╨╡╨┐╨╗╨╛╤Б╤З╨╡╤В╤З╨╕╨║╨░╤Е ╨╕ ╨┤╤А╤Г╨│╨╛╨╝ ╨╛╨▒╨╛╤А╤Г╨┤╨╛╨▓╨░╨╜╨╕╨╕;\r\n\r\n╨Т ╤Е╨╕╨╝╨╕╤З╨╡╤Б╨║╨╛╨╣ ╨┐╤А╨╛╨╝╤Л╤И╨╗╨╡╨╜╨╜╨╛╤Б╤В╨╕ ╨┐╤А╨╡╨╛╨▒╤А╨░╨╖╨╛╨▓╨░╤В╨╡╨╗╨╕ ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╤О╤В╤Б╤П ╨┤╨╗╤П ╨║╨╛╨╜╤В╤А╨╛╨╗╤П ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╨▓ ╤А╨╡╨░╨║╤В╨╛╤А╨░╤Е, ╨║╨╛╨╗╨╛╨╜╨╜╨░╤Е, ╨╡╨╝╨║╨╛╤Б╤В╤П╤Е ╨╕ ╨┤╤А╤Г╨│╨╕╤Е ╨░╨┐╨┐╨░╤А╨░╤В╨░╤Е, ╨░ ╤В╨░╨║╨╢╨╡ ╨┤╨╗╤П ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П ╤Б╨║╨╛╤А╨╛╤Б╤В╨╕ ╨┐╨╛╤В╨╛╨║╨░ ╨╕ ╤А╨░╤Б╤Е╨╛╨┤╨░ ╤Е╨╕╨╝╨╕╤З╨╡╤Б╨║╨╕╤Е ╤А╨╡╨░╨│╨╡╨╜╤В╨╛╨▓;\r\n\r\n╨Т ╨▓╨░╨║╤Г╤Г╨╝╨╜╨╛╨╣ ╤В╨╡╤Е╨╜╨╕╨║╨╡ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╤О╤В╤Б╤П ╨┤╨╗╤П ╨║╨╛╨╜╤В╤А╨╛╨╗╤П ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╨▓ ╨▓╨░╨║╤Г╤Г╨╝╨╜╤Л╤Е ╨╜╨░╤Б╨╛╤Б╨░╤Е, ╨║╨░╨╝╨╡╤А╨░╤Е, ╤Г╤Б╤В╨░╨╜╨╛╨▓╨║╨░╤Е ╨╕ ╨┤╤А╤Г╨│╨╕╤Е ╤Б╨╕╤Б╤В╨╡╨╝╨░╤Е.	╨Ш╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П: ╤И╤В╤Г╤Ж╨╡╤А╨╜╨╛╨╡, ╤Б ╨╛╤В╨║╤А╤Л╤В╨╛╨╣ ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╤М╨╜╨╛╨╣ ╨╝╨╡╨╝╨▒╤А╨░╨╜╨╜╨╛╨╣ ╨╕╨╗╨╕ ╨▓╤Л╨╜╨╛╤Б╨╜╨╛╨╣ ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╤М╨╜╨╛╨╣ ╨╝╨╡╨╝╨▒╤А╨░╨╜╨╛╨╣, ╤Б ╤В╤А╨░╨┤╨╕╤Ж╨╕╨╛╨╜╨╜╤Л╨╝ ╤Д╨╗╨░╨╜╤Ж╨╡╨▓╤Л╨╝ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡╨╝ ╨┐╨╛ ╤Б╤В╨░╨╜╨┤╨░╤А╤В╨░╨╝ EN 61518: IEC 61518. ╨Ф╨╕╨░╨┐╨░╨╖╨╛╨╜ ╨╜╨░╤Б╤В╤А╨░╨╕╨▓╨░╨╡╨╝╨╛╨│╨╛ ╨▓╨╡╤А╤Е╨╜╨╡╨│╨╛ ╨┐╤А╨╡╨┤╨╡╨╗╨░ ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П (╨Т╨Я╨Ш) ╨╛╤В 100 ╨Я╨░ ╨┤╨╛ 70 ╨Ь╨Я╨░. ╨Я╨╡╤А╨╡╨╜╨░╤Б╤В╤А╨╛╨╣╨║╨░ ╨┤╨╕╨░╨┐╨░╨╖╨╛╨╜╨░ ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П 100:1, ╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░ ╤Б╤А╨╡╨┤╤Л ╨┤╨╛ 700 ┬║C, ╤Б╨░╨╝╨╛╨┤╨╕╨░╨│╨╜╨╛╤Б╤В╨╕╨║╨░ NAMUR NE107, ╤Б╨╛╨╛╤В╨▓╨╡╤В╤Б╤В╨▓╨╕╨╡ ╤В╤А╨╡╨▒╨╛╨▓╨░╨╜╨╕╤П╨╝ ╤Д╤Г╨╜╨║╤Ж╨╕╨╛╨╜╨░╨╗╤М╨╜╨╛╨╣ ╨▒╨╡╨╖╨╛╨┐╨░╤Б╨╜╨╛╤Б╤В╨╕ SIL2.	9823	t
4	╨Ь╨Ч╨Ь-╨У╨Ф-1 ╨│╨╕╨┤╤А╨╛╤Б╤В╨░╤В╨╕╤З╨╡╤Б╨║╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П	60000	╨Ф╨░╤В╤З╨╕╨║ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П	╨У╨╕╨┤╤А╨╛╤Б╤В╨░╤В╨╕╤З╨╡╤Б╨║╨╛╨╡ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡	╨Ф╨░╤В╤З╨╕╨║ ╨│╨╕╨┤╤А╨╛╤Б╤В╨░╤В╨╕╤З╨╡╤Б╨║╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П.png	╨Ф╨░╤В╤З╨╕╨║╨╕ ╨│╨╕╨┤╤А╨╛╤Б╤В╨░╤В╨╕╤З╨╡╤Б╨║╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╤В╨░╨║╨╢╨╡ ╨┐╨╛╨╗╤Г╤З╨╕╨╗╨╕ ╨╜╨░╨╕╨╝╨╡╨╜╨╛╨▓╨░╨╜╨╕╨╡ ╤Г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А╤Л, ╨┐╨╛╤Б╨║╨╛╨╗╤М╨║╤Г ╨╛╨╜╨╕ ╤Б╨┐╨╛╤Б╨╛╨▒╨╜╤Л ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╤М ╤Г╤З╨╡╤В ╨╛╨▒╤К╨╡╨╝╨░ ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╕ ╨▓ ╨╡╨╝╨║╨╛╤Б╤В╨╕. ╨Ш╨╖╨╝╨╡╤А╨╡╨╜╨╕╨╡ ╨┐╤А╨╛╨▓╨╛╨┤╨╕╤В╤Б╤П ╨┐╤А╨╕ ╨┐╨╛╨╝╨╛╤Й╨╕ ╤Б╤В╨╛╨╗╨▒╨░ ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╕ ╨╜╨░ ╨┐╨╗╤О╤Б╨╛╨▓╤Г╤О ╨╝╨╡╨╝╨▒╤А╨░╨╜╤Г ╨╕, ╨┐╤А╨╕ ╨╜╨╡╨╛╨▒╤Е╨╛╨┤╨╕╨╝╨╛╤Б╤В╨╕, ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П ╨╝╨╕╨╜╤Г╤Б╨╛╨▓╨╛╨╣ ╨┐╨╛╨╗╨╛╤Б╤В╤М╤О ╨┐╨╛╨┤ ╨║╤Г╨┐╨╛╨╗╨╛╨╝ ╨╡╨╝╨║╨╛╤Б╤В╨╕, ╨┤╨╗╤П ╨╕╤Б╨║╨╗╤О╤З╨╡╨╜╨╕╤П ╨▓╨╗╨╕╤П╨╜╨╕╤П ╨╜╨░╤Б╤Л╤Й╨╡╨╜╨╜╨╛╨│╨╛ ╨┐╨░╤А╨░.\r\n\r\n╨г╤Б╤В╤А╨╛╨╣╤Б╤В╨▓╨░ ╨╕╨╝╨╡╤О╤В ╨┤╨╛╨┐╨╛╨╗╨╜╨╕╤В╨╡╨╗╤М╨╜╤Л╨╣ ╤Б╨╡╤А╤В╨╕╤Д╨╕╨║╨░╤В ╨╜╨░ ╤Н╨║╤Б╨┐╨╗╤Г╨░╤В╨░╤Ж╨╕╤О ╨▓ ╤Б╤А╨╡╨┤╨╡ ╤Б╨╡╤А╨╛╨▓╨╛╨┤╨╛╤А╨╛╨┤╨░ (╨У╨Ю╨б╨в ╨а 53679 ╨╕ 53676), ╤Г╤А╨╛╨▓╨╡╨╜╤М ╨┐╨╛╨╗╨╜╨╛╤В╤Л ╨▒╨╡╨╖╨╛╨┐╨░╤Б╨╜╨╛╤Б╤В╨╕ SIL-2 (╨У╨Ю╨б╨в ╨а ╨Ь╨н╨Ъ 61508) SIL, ╨╖╨░╨║╨╗╤О╤З╨╡╨╜╨╕╨╡ ╨┐╨╛ ╤Б╨░╨╜╨╕╤В╨░╤А╨╜╨╛-╨│╨╕╨│╨╕╨╡╨╜╨╕╤З╨╡╤Б╨║╨╛╨╣ ╤Н╨║╤Б╨┐╨╡╤А╤В╨╕╨╖╨╡, ╤З╤В╨╛ ╨┐╨╛╨╖╨▓╨╛╨╗╤П╨╡╤В ╨╕╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╤В╤М ╨╕╤Е ╨▓ ╨┐╨╕╤Й╨╡╨▓╨╛╨╣ ╨┐╤А╨╛╨╝╤Л╤И╨╗╨╡╨╜╨╜╨╛╤Б╤В╨╕.\r\n\r\n╨Ш╨╝╨╡╨╡╤В╤Б╤П ╨┤╨╛╨┐╨╛╨╗╨╜╨╕╤В╨╡╨╗╤М╨╜╨░╤П ╨╛╨┐╤Ж╨╕╤П тАУ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╨╡ ╤Б ╤А╨░╨┤╨╕╨░╤В╨╛╤А╨╛╨╝ ╨╝╨╡╨╢╨┤╤Г ╨║╨╛╤А╨┐╤Г╤Б╨╛╨╝ ╨┤╨░╤В╤З╨╕╨║╨░ ╨╕ ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╤М╨╜╨╛╨╣ ╨╝╨╡╨╝╨▒╤А╨░╨╜╨╛╨╣ ╨┤╨╗╤П ╤А╨░╨▒╨╛╤В╤Л ╨┐╤А╨╕ ╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨╡ ╨┤╨╛ 200┬░╨б. ╨Я╤А╨╕ ╤Б╨┐╨╡╤Ж╨╖╨░╨║╨░╨╖╨╡ ╨┤╨╡╨╗╨░╨╡╤В╤Б╤П ╨▓╨╜╨╡╤И╨╜╤П╤П ╨╖╨░╤Й╨╕╤В╨╜╨░╤П ╨╛╨▒╤А╨░╨▒╨╛╤В╨║╨░, ╨╡╤Б╨╗╨╕ ╨╛╨║╤А╤Г╨╢╨░╤О╤Й╨░╤П ╤Б╤А╨╡╨┤╨░ ╨╛╨▒╨╗╨░╨┤╨░╨╡╤В ╨▓╤Л╤Б╨╛╨║╨╛╨╣ ╨║╨╛╤А╤А╨╛╨╖╨╕╨╛╨╜╨╜╨╛╨╣ ╨░╨║╤В╨╕╨▓╨╜╨╛╤Б╤В╤М╤О. ╨Я╨╡╤А╨╡╤З╨╡╨╜╤М ╨▓╤Б╨╡╤Е ╨┤╨╛╨┐╨╛╨╗╨╜╨╕╤В╨╡╨╗╤М╨╜╤Л╤Е ╨╛╨┐╤Ж╨╕╨╣ ╨╕ ╤Б╨┐╨╡╤Ж╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╨╣ ╨┐╤А╨╛╨┐╨╕╤Б╨░╨╜ ╨▓ ╤А╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╡ ╨┐╨╛ ╤Н╨║╤Б╨┐╨╗╤Г╨░╤В╨░╤Ж╨╕╨╕.	╨Т╨░╤А╨╕╨░╨╜╤В╤Л ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╤П ╨┤╨░╤В╤З╨╕╨║╨░ ╨│╨╕╨┤╤А╨╛╤Б╤В╨░╤В╨╕╤З╨╡╤Б╨║╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╨║ ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╤Г: ╤Б ╨╝╨╡╨╝╨▒╤А╨░╨╜╨╜╤Л╨╝ ╤Д╨╗╨░╨╜╤Ж╨╡╨▓╤Л╨╝ ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╨╡╨╝ ╤Б╤В╨░╨╜╨┤╨░╤А╤В╨╜╨╛╨╣ ╨╕ ╤В╤Г╨▒╤Г╤Б╨╜╨╛╨╣ ╨║╨╛╨╜╤Б╤В╤А╤Г╨║╤Ж╨╕╨╕. ╨Ф╨╛ 3 ╨Ь╨Я╨░.	9823	t
5	╨Ь╨Ч╨Ь-╨Т╨Р-1 ╨▓╨╕╤Е╤А╨╡╨░╨║╤Г╤Б╤В╨╕╤З╨╡╤Б╨║╨╛╨│╨╛ ╤А╨░╤Б╤Е╨╛╨┤╨░	90000	╨Ф╨░╤В╤З╨╕╨║ ╤А╨░╤Б╤Е╨╛╨┤╨░	╨Т╨╕╤Е╤А╨╡╨░╨║╤Г╤Б╤В╨╕╤З╨╡╤Б╨║╨╕╨╣ ╤А╨░╤Б╤Е╨╛╨┤	╨▓╨╕╤Е╤А╨╡╨░╨║╤Г╤Б╤В╨╕╤З╨╡╤Б╨║╨╕╨╣.png	╨Я╤А╨╕╨╜╤Ж╨╕╨┐ ╨╡╨│╨╛ ╤А╨░╨▒╨╛╤В╤Л ╨╖╨░╨║╨╗╤О╤З╨░╨╡╤В╤Б╤П ╨▓ ╤Б╨╗╨╡╨┤╤Г╤О╤Й╨╡╨╝: ╤Н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╤Л╨╣ ╨▒╨╗╨╛╨║ ╤Д╨╛╤А╨╝╨╕╤А╤Г╨╡╤В ╨╜╨░ ╨┤╨░╤В╤З╨╕╨║╨╡-╨╕╨╖╨╗╤Г╤З╨░╤В╨╡╨╗╨╡ ╨▓╤Л╤Б╨╛╨║╨╛╤З╨░╤Б╤В╨╛╤В╨╜╤Л╨╣ ╤Г╨╗╤М╤В╤А╨░╨╖╨▓╤Г╨║╨╛╨▓╨╛╨╣ ╤Б╨╕╨│╨╜╨░╨╗, ╨║╨╛╤В╨╛╤А╤Л╨╣ ╨┐╤А╨╛╤Е╨╛╨┤╤П ╤З╨╡╤А╨╡╨╖ ╨▓╨╕╤Е╤А╨╡╨▓╤Г╤О ╨┤╨╛╤А╨╛╨╢╨║╤Г, ╨╝╨╛╨┤╤Г╨╗╨╕╤А╤Г╨╡╤В╤Б╤П ╨┐╨╛ ╤Д╨░╨╖╨╡ ╨╕ ╨┐╨╛╤Б╤В╤Г╨┐╨░╨╡╤В ╨╜╨░ ╨┤╨░╤В╤З╨╕╨║ ╨┐╤М╨╡╨╖╨╛╨┐╤А╨╕╨╡╨╝╨╜╨╕╨║╨░. ╨в╨░╨║╨╛╨╣ ╨╝╨╡╤В╨╛╨┤ ╨╛╨▒╨╡╤Б╨┐╨╡╤З╨╕╨▓╨░╨╡╤В ╨▓╨╕╨▒╤А╨╛╤Г╤Б╤В╨╛╨╣╤З╨╕╨▓╨╛╤Б╤В╤М ╨╕ ╤А╨░╤Б╤И╨╕╤А╤П╨╡╤В ╨┤╨╕╨╜╨░╨╝╨╕╤З╨╡╤Б╨║╨╕╨╣ ╨┤╨╕╨░╨┐╨░╨╖╨╛╨╜ (╨┤╨╛ ╨╖╨╜╨░╤З╨╡╨╜╨╕╤П 1:100).\r\n\r\n╨в╨░╨║╨╢╨╡ ╨┤╨╗╤П ╤А╨░╤Б╤Е╨╛╨┤╨╛╨╝╨╡╤А╨░ ╨▓╨╜╨╡╨┤╤А╨╡╨╜╨░ ╨░╨▓╤В╨╛╨╝╨░╤В╨╕╤З╨╡╤Б╨║╨░╤П ╨┐╨╛╨┤╤Б╤В╤А╨╛╨╣╨║╨░ ╤Г╤А╨╛╨▓╨╜╤П ╤Б╨╕╨│╨╜╨░╨╗╨╛╨▓, ╨┐╨╛╨╖╨▓╨╛╨╗╤П╤О╤Й╨░╤П ╨║╨╛╨╝╨┐╨╡╨╜╤Б╨╕╤А╨╛╨▓╨░╤В╤М ╨╖╨░╨│╤А╤П╨╖╨╜╨╡╨╜╨╕╤П ╤Б╨╡╨╜╤Б╨╛╤А╨╛╨▓ ╨╕ ╨╕╤Е ╨┤╨╡╨│╤А╨░╨┤╨░╤Ж╨╕╤О ╨┐╨╛ ╨╝╨╡╤А╨╡ ╤Б╤В╨░╤А╨╡╨╜╨╕╤П ╨┐╤А╨╕╨▒╨╛╤А╨░.\r\n\r\n╨Т ╨▒╨░╨╖╨╛╨▓╨╛╨╣ ╨▓╨╡╤А╤Б╨╕╨╕ ╤Н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╤Л╨╣ ╨▒╨╗╨╛╨║ ╨┐╨╛╤Б╤В╨░╨▓╨╗╤П╨╡╤В╤Б╤П ╤Б ╤З╨░╤Б╤В╨╛╤В╨╜╨╛/╨╕╨╝╨┐╤Г╨╗╤М╤Б╨╜╤Л╨╝ ╨▓╤Л╤Е╨╛╨┤╨╛╨╝ ╨╕ ╤Ж╨╕╤Д╤А╨╛╨▓╤Л╨╝ ╨▓╤Л╤Е╨╛╨┤╨╜╤Л╨╝ ╤Б╨╕╨│╨╜╨░╨╗╨╛╨╝ Modbus ╤Б ╨╕╨╜╤В╨╡╤А╤Д╨╡╨╣╤Б╨╛╨╝ RS-485. ╨Ю╨┤╨╜╨░╨║╨╛, ╨┐╨╛ ╨╢╨╡╨╗╨░╨╜╨╕╤О ╨╖╨░╨║╨░╨╖╤З╨╕╨║╨░, ╨┐╤А╨╕╨▒╨╛╤А╤Л ╨╝╨╛╨│╤Г╤В ╨▒╤Л╤В╤М ╨╕╨╖╨│╨╛╤В╨╛╨▓╨╗╨╡╨╜╤Л ╤Б ╤З╨╡╤В╤Л╤А╨╡╤Е╤Б╤В╤А╨╛╤З╨╜╤Л╨╝ OLED-╨╕╨╜╨┤╨╕╨║╨░╤В╨╛╤А╨╛╨╝, ╨░╨╜╨░╨╗╨╛╨│╨╛╨▓╤Л╨╝ ╨▓╤Л╤Е╨╛╨┤╨╜╤Л╨╝ ╤Б╨╕╨│╨╜╨░╨╗╨╛╨╝ ╨╕ ╤Ж╨╕╤Д╤А╨╛╨▓╤Л╨╝ ╨┐╤А╨╛╤В╨╛╨║╨╛╨╗╨╛╨╝ HART.\r\n\r\n╨Т╨╖╤А╤Л╨▓╨╛╨╖╨░╤Й╨╕╤Й╨╡╨╜╨╜╨╛╨╡ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╨╡ ╨╕ ╤И╨╕╤А╨╛╨║╨╕╨╣ ╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨╜╤Л╨╣ ╨┤╨╕╨░╨┐╨░╨╖╨╛╨╜ (╨╛╤В -60 ╨┤╨╛ +70 ┬║C) ╨┐╨╛╨╖╨▓╨╛╨╗╤П╤О╤В ╤Н╨║╤Б╨┐╨╗╤Г╨░╤В╨╕╤А╨╛╨▓╨░╤В╤М ╤А╨░╤Б╤Е╨╛╨┤╨╛╨╝╨╡╤А ╨▓ ╤Н╨║╤Б╤В╤А╨╡╨╝╨░╨╗╤М╨╜╤Л╤Е ╤Г╤Б╨╗╨╛╨▓╨╕╤П╤Е.\r\n\r\n╨Ю╨╜ ╨┐╤А╨╡╨┤╨╜╨░╨╖╨╜╨░╤З╨╡╨╜ ╨┤╨╗╤П ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П ╨╛╨▒╤К╨╡╨╝╨░ ╨╕ ╨╛╨▒╤К╨╡╨╝╨╜╨╛╨│╨╛ ╤А╨░╤Б╤Е╨╛╨┤╨░ ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╡╨╣ ╨▓ ╤В╤А╤Г╨▒╨╛╨┐╤А╨╛╨▓╨╛╨┤╨░╤Е ╤Б╨╕╤Б╤В╨╡╨╝ ╨Я╨Я╨Ф (╨┐╨╛╨┤╨┤╨╡╤А╨╢╨░╨╜╨╕╤П ╨┐╨╗╨░╤Б╤В╨╛╨▓╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П), ╨░ ╤В╨░╨║╨╢╨╡ ╨┤╤А╤Г╨│╨╕╤Е ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╡╨╣ ╨┐╤А╨╕ ╨▓╤Л╤Б╨╛╨║╨╛╨╝ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╕.	╨Я╤А╨╡╨╛╨▒╤А╨░╨╖╨╛╨▓╨░╤В╨╡╨╗╨╕ ╤А╨░╤Б╤Е╨╛╨┤╨░ ╨╝╨╛╨│╤Г╤В ╨╕╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╤В╤М╤Б╤П ╨▓ ╤Б╨╛╤Б╤В╨░╨▓╨╡ ╨░╨▓╤В╨╛╨╝╨░╤В╨╕╤З╨╡╤Б╨║╨╕╤Е ╤Б╨╕╤Б╤В╨╡╨╝ ╤Г╨┐╤А╨░╨▓╨╗╨╡╨╜╨╕╤П ╨╕ ╨║╨╛╨╜╤В╤А╨╛╨╗╤П, ╨╗╨╛╨║╨░╨╗╤М╨╜╤Л╤Е ╤Б╤Е╨╡╨╝╨░╤Е ╨░╨▓╤В╨╛╨╝╨░╤В╨╕╨╖╨░╤Ж╨╕╨╕ ╤Б ╨╕╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╨╜╨╕╨╡╨╝ ╤З╨░╤Б╤В╨╛╤В╨╜╨╛-╨╕╨╝╨┐╤Г╨╗╤М╤Б╨╜╨╛╨│╨╛ ╤Б╨╕╨│╨╜╨░╨╗╨░, ╤В╨╛╨║╨╛╨▓╨╛╨│╨╛ ╤Б╨╕╨│╨╜╨░╨╗╨░ ╨╕ ╤Ж╨╕╤Д╤А╨╛╨▓╨╛╨│╨╛ ╤Б╨╕╨│╨╜╨░╨╗╨░ ModBus (RS485) ╨╕ HART.	123456	t
7	╨Ь╨Ч╨Ь-╨Т╨а-2 ╨▓╨╕╤Е╤А╨╡╨▓╨╛╨│╨╛ ╤А╨░╤Б╤Е╨╛╨┤╨░	89000	╨Ф╨░╤В╤З╨╕╨║ ╤А╨░╤Б╤Е╨╛╨┤╨░	╨Т╨╕╤Е╤А╨╡╨▓╨╛╨╣ ╤А╨░╤Б╤Е╨╛╨┤	╨Ф╨░╤В╤З╨╕╨║ ╨▓╨╕╤Е╤А╨╡╨▓╨╛╨╣ ╤А╨░╤Б╤Е╨╛╨┤.png	╨б╤З╨╡╤В╤З╨╕╨║ ╨╜╨╡ ╤В╤А╨╡╨▒╤Г╨╡╤В ╨┐╨╡╤А╨╕╨╛╨┤╨╕╤З╨╡╤Б╨║╨╛╨╣ ╨║╨░╨╗╨╕╨▒╤А╨╛╨▓╨║╨╕, ╨░ ╨┤╨╕╨░╨│╨╜╨╛╤Б╤В╨╕╨║╨░ ╨╕ ╨╖╨░╨╝╨╡╨╜╨░ ╤Г╨╖╨╗╨╛╨▓ ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╤Б╤П ╨▒╨╡╨╖ ╨┤╨╡╨╝╨╛╨╜╤В╨░╨╢╨░. ╨Ф╨╛╤Б╤В╨░╨▓╨╗╤П╤О╤В ╤Б╤З╨╡╤В╤З╨╕╨║╨╕ ╤В╨╛╨╗╤М╨║╨╛ ╨┐╨╛╤Б╨╗╨╡ ╨┐╤А╨╛╤Е╨╛╨╢╨┤╨╡╨╜╨╕╤П ╨╛╨▒╤П╨╖╨░╤В╨╡╨╗╤М╨╜╨╛╨│╨╛ ╨┐╤А╨╛╨╗╨╕╨▓╨░ ╨╜╨░ ╨┐╨╛╨▓╨╡╤А╨╛╤З╨╜╨╛╨╝ ╤Б╤В╨╡╨╜╨┤╨╡. ╨г╨┤╨░╨╗╨╡╨╜╨╜╨░╤П ╨┐╨╡╤А╨╡╨┤╨░╤З╨░ ╨┤╨░╨╜╨╜╤Л╤Е, ╨╜╨░╤Б╤В╤А╨╛╨╣╨║╨░, ╨┐╨╛╨▓╨╡╤А╨║╨░ ╨┐╤А╨╕╨▒╨╛╤А╨╛╨▓ (╤З╨╡╤А╨╡╨╖ RS-485 ╨╜╨░ ╨▒╨░╨╖╨╡ ╨┐╤А╨╛╤В╨╛╨║╨╛╨╗╨░ Modbus RTU) ╨┐╨╛╨╖╨▓╨╛╨╗╤П╤О╤В ╤Б╨╜╨╕╨╢╨░╤В╤М ╤А╨░╤Б╤Е╨╛╨┤╤Л ╨╜╨░ ╨╛╨▒╤Б╨╗╤Г╨╢╨╕╨▓╨░╨╜╨╕╨╡. ╨б╤З╨╡╤В╤З╨╕╨║ ╨╕╨╝╨╡╨╡╤В ╤И╨╕╤А╨╛╨║╨╕╨╣ ╨┤╨╕╨╜╨░╨╝╨╕╤З╨╡╤Б╨║╨╕╨╣ ╨┤╨╕╨░╨┐╨░╨╖╨╛╨╜ ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╨╣; ╨▓╨░╨╢╨╜╤Л╨╝ ╨┐╤А╨╡╨╕╨╝╤Г╤Й╨╡╤Б╤В╨▓╨╛╨╝ ╤П╨▓╨╗╤П╨╡╤В╤Б╤П ╨╜╨░╨╗╨╕╤З╨╕╨╡ ╨║╨╛╨╜╤Б╤В╤А╤Г╨║╤В╨╕╨▓╨╜╨╛╨│╨╛ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П ╤Б ╨║╨╛╨╜╨╕╤З╨╡╤Б╨║╨╕╨╝╨╕ ╨┐╨╡╤А╨╡╤Е╨╛╨┤╨░╨╝╨╕.\r\n\r\n╨Т╤Л╤Б╨╛╨║╨░╤П ╤В╨╛╤З╨╜╨╛╤Б╤В╤М ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╨╣ ╨┐╨╛╨╖╨▓╨╛╨╗╤П╨╡╤В ╨╕╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╤В╤М ╨▓╨╕╤Е╤А╨╡╨▓╨╛╨╣ ╤Б╤З╨╡╤В╤З╨╕╨║ ╨│╨░╨╖╨░ ╨╕ ╨┐╨░╤А╨░ ╨┤╨╗╤П ╨║╨╛╨╝╨╝╨╡╤А╤З╨╡╤Б╨║╨╛╨│╨╛ ╤Г╤З╨╡╤В╨░ ╨▓ ╤Б╨╛╤Б╤В╨░╨▓╨╡ ╤В╨╡╨┐╨╗╨╛╤Б╤З╨╡╤В╤З╨╕╨║╨╛╨▓ ╨╕ ╤Б╤З╨╡╤В╤З╨╕╨║╨╛╨▓ ╨┐╨░╤А╨░	╨Я╤А╨╕ ╨┐╨╛╨║╤Г╨┐╨║╨╡ ╨╗╤О╨▒╨╛╨│╨╛ ╨┐╤А╨╕╨▒╨╛╤А╨░ ╨╝╤Л ╨┐╤А╨╡╨┤╨╛╤Б╤В╨░╨▓╨╗╤П╨╡╨╝ ╨▓╨░╨╝ ╨┐╨╛╨┤╨┤╨╡╤А╨╢╨║╤Г ╨┐╤А╨╕ ╨┐╤А╨╛╨╡╨║╤В╨╕╤А╨╛╨▓╨░╨╜╨╕╨╕, ╤А╨░╨╖╤А╨░╨▒╨╛╤В╨║╨╡ ╨║╨╛╨╝╨┐╨╗╨╡╨║╤Б╨╛╨▓ ╨╕ ╨╕╨╖╨╝╨╡╤А╨╕╤В╨╡╨╗╤М╨╜╤Л╤Е ╤Б╨╕╤Б╤В╨╡╨╝, ╨╕╨╜╨┤╨╕╨▓╨╕╨┤╤Г╨░╨╗╤М╨╜╨╛╨╝ ╨┐╨╛╨┤╨▒╨╛╤А╨╡. ╨Т ╨╖╨░╨▓╨╕╤Б╨╕╨╝╨╛╤Б╤В╨╕ ╨╛╤В ╨┐╤А╨╛╨╡╨║╤В╨░ ╨╕╨╜╨╢╨╡╨╜╨╡╤А╤Л ╨║╨╛╨╝╨┐╨░╨╜╨╕╨╕ ╨┐╤А╨╡╨┤╨╛╤Б╤В╨░╨▓╤П╤В ╤Б╤В╨░╨╜╨┤╨░╤А╤В╨╜╨╛╨╡ ╨╗╨╕╨▒╨╛ ╤Г╨╜╨╕╨║╨░╨╗╤М╨╜╨╛╨╡ ╨╕╨╜╨┤╨╕╨▓╨╕╨┤╤Г╨░╨╗╤М╨╜╨╛╨╡ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╨╡ ╤А╨░╤Б╤Е╨╛╨┤╨╛╨╝╨╡╤А╨░. ╨Я╤А╨╕╨▒╨╛╤А╤Л ╨▓╤Л╨┐╤Г╤Б╨║╨░╤О╤В╤Б╤П ╨▓ ╨╜╨╡╤Б╨║╨╛╨╗╤М╨║╨╕╤Е ╨╝╨╛╨┤╨╕╤Д╨╕╨║╨░╤Ж╨╕╤П╤Е, ╨░ ╨╖╨╜╨░╤З╨╕╤В ╤Н╤В╨╛ ╤Г╨╜╨╕╨▓╨╡╤А╤Б╨░╨╗╤М╨╜╤Л╨╡ ╤Б╤З╨╡╤В╤З╨╕╨║╨╕, ╨║╨╛╤В╨╛╤А╤Л╨╡ ╨╝╨╛╨╢╨╜╨╛ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╤В╤М ╨▓ ╤А╨░╨╖╨╗╨╕╤З╨╜╤Л╤Е ╤Б╤Д╨╡╤А╨░╤Е ╨┐╤А╨╛╨╝╤Л╤И╨╗╨╡╨╜╨╜╨╛╤Б╤В╨╕ ╨╕ ╤Е╨╛╨╖╤П╨╣╤Б╤В╨▓╨░.	123456	t
10	╨Ь╨Ч╨Ь-╨Т╨г-1 ╨▓╨╛╨╗╨╜╨╛╨▓╨╛╨┤╨╜╤Л╨╣	123221	╨Ф╨░╤В╤З╨╕╨║ ╤Г╤А╨╛╨▓╨╜╤П	╨Т╨╛╨╗╨╜╨╛╨▓╨╛╨┤╨╜╤Л╨╡	╨Т╨╛╨╗╨╜╨╛╨▓╨╛╨╣ ╤Г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А.png	╨г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А╤Л ╨▓╨╛╨╗╨╜╨╛╨▓╨╛╨┤╨╜╤Л╨╡ ╨Ь╨Ч╨Ь-╨Т╨г-1 ╨┐╤А╨╡╨┤╨╜╨░╨╖╨╜╨░╤З╨╡╨╜╤Л ╨┤╨╗╤П ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╨╣ ╤Г╤А╨╛╨▓╨╜╤П ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╕, ╨▓ ╤В╨╛╨╝ ╤З╨╕╤Б╨╗╨╡ ╤Б╨╢╨╕╨╢╨╡╨╜╨╜╤Л╤Е ╨│╨░╨╖╨╛╨▓, ╨╕ ╤Б╤Л╨┐╤Г╤З╨╕╤Е ╨╝╨░╤В╨╡╤А╨╕╨░╨╗╨╛╨▓ ╨┐╤А╨╕ ╨░╤В╨╝╨╛╤Б╤Д╨╡╤А╨╜╨╛╨╝ ╨╕ ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╨╝ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╕.\r\n\r\n╨Я╤А╨╕╨╜╤Ж╨╕╨┐ ╨┤╨╡╨╣╤Б╤В╨▓╨╕╤П ╨▓╨╛╨╗╨╜╨╛╨▓╨╛╨┤╨╜╤Л╤Е ╤Г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А╨╛╨▓ ╨╛╤Б╨╜╨╛╨▓╨░╨╜ ╨╜╨░ ╨╕╨╖╨╗╤Г╤З╨╡╨╜╨╕╨╕ ╤Н╨╗╨╡╨║╤В╤А╨╛╨╝╨░╨│╨╜╨╕╤В╨╜╤Л╤Е ╨╕╨╝╨┐╤Г╨╗╤М╤Б╨╛╨▓, ╤А╨░╤Б╨┐╤А╨╛╤Б╤В╤А╨░╨╜╤П╤О╤Й╨╕╤Е╤Б╤П ╨▓╨┤╨╛╨╗╤М ╨╖╨╛╨╜╨┤╨░ ╨▓ ╤Б╤В╨╛╤А╨╛╨╜╤Г ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л. ╨Я╤А╨╕ ╨┤╨╛╤Б╤В╨╕╨╢╨╡╨╜╨╕╨╕ ╤Б╤А╨╡╨┤╤Л ╤Б ╨┤╤А╤Г╨│╨╛╨╣ ╨┤╨╕╤Н╨╗╨╡╨║╤В╤А╨╕╤З╨╡╤Б╨║╨╛╨╣ ╨┐╤А╨╛╨╜╨╕╤Ж╨░╨╡╨╝╨╛╤Б╤В╤М╤О ╤З╨░╤Б╤В╤М ╨╕╨╝╨┐╤Г╨╗╤М╤Б╨╛╨▓ ╨╛╤В╤А╨░╨╢╨░╨╡╤В╤Б╤П ╨╕ ╨┐╨╡╤А╨╡╨┤╨░╤С╤В╤Б╤П ╨╛╨▒╤А╨░╤В╨╜╨╛.\r\n\r\n╨Э╨░ ╨╛╤Б╨╜╨╛╨▓╨░╨╜╨╕╨╕ ╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨╣ ╨╖╨░╨┤╨╡╤А╨╢╨║╨╕ ╨╝╨╡╨╢╨┤╤Г ╨╕╨╖╨╗╤Г╤З╨╡╨╜╨╜╤Л╨╝ ╨╕ ╨┐╤А╨╕╨╜╤П╤В╤Л╨╝ ╤Б╨╕╨│╨╜╨░╨╗╨╛╨╝ ╤А╨░╤Б╤Б╤З╨╕╤В╤Л╨▓╨░╨╡╤В╤Б╤П ╨╖╨╜╨░╤З╨╡╨╜╨╕╨╡ ╤Г╤А╨╛╨▓╨╜╤П ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л. ╨Р╨╜╨░╨╗╨╛╨│╨╕╤З╨╜╤Л╨╝ ╨╛╨▒╤А╨░╨╖╨╛╨╝ ╨╕╨╖╨╝╨╡╤А╤П╨╡╤В╤Б╤П ╤А╨░╤Б╤Б╤В╨╛╤П╨╜╨╕╨╡ ╨╝╨╡╨╢╨┤╤Г ╤Б╨╡╨╜╤Б╨╛╤А╨╛╨╝ ╨╕ ╨│╤А╨░╨╜╨╕╤Ж╨╡╨╣ ╤А╨░╨╖╨┤╨╡╨╗╨░ ╨┤╨▓╤Г╤Е ╨╢╨╕╨┤╨║╨╕╤Е ╤Б╤А╨╡╨┤ ╤Б ╤А╨░╨╖╨╗╨╕╤З╨╜╤Л╨╝╨╕ ╨║╨╛╤Н╤Д╤Д╨╕╤Ж╨╕╨╡╨╜╤В╨░╨╝╨╕ ╨┤╨╕╤Н╨╗╨╡╨║╤В╤А╨╕╤З╨╡╤Б╨║╨╛╨╣ ╨┐╤А╨╛╨╜╨╕╤Ж╨░╨╡╨╝╨╛╤Б╤В╨╕.	╨Т╨╛╨╗╨╜╨╛╨▓╨╛╨┤╨╜╤Л╨╡ ╤Г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А╤Л ╨Ь╨Ч╨Ь-╨Т╨г-1 ╨┐╤А╨╡╨┤╨╜╨░╨╖╨╜╨░╤З╨╡╨╜╤Л ╨┤╨╗╤П ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П ╨╕ ╨║╨╛╨╜╤В╤А╨╛╨╗╤П ╤Г╤А╨╛╨▓╨╜╤П ╨╕ ╨│╤А╨░╨╜╨╕╤Ж╤Л ╤А╨░╨╖╨┤╨╡╨╗╨░ ╤Д╨░╨╖ ╨╢╨╕╨┤╨║╨╕╤Е ╨╕ ╤Б╤Л╨┐╤Г╤З╨╕╤Е ╤Б╤А╨╡╨┤.	9999	t
9	╨Ь╨Ч╨Ь-╨а╨г-1 ╤А╨░╨┤╨░╤А╨╜╤Л╨╣	55555	╨Ф╨░╤В╤З╨╕╨║ ╤Г╤А╨╛╨▓╨╜╤П	╨а╨░╨┤╨░╤А╨╜╤Л╨╡	╨г╨а╨Ю╨Т╨Э╨Х╨Ь╨Х╨а ╨а╨Р╨Ф╨Р╨а╨Э╨л╨Щ.png	╨Я╤А╨╕╨╜╤Ж╨╕╨┐ ╨┤╨╡╨╣╤Б╤В╨▓╨╕╤П ╤Г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А╨╛╨▓ ╨╛╤Б╨╜╨╛╨▓╨░╨╜ ╨╜╨░ ╨╕╨╖╨╗╤Г╤З╨╡╨╜╨╕╨╕ ╨░╨╜╤В╨╡╨╜╨╜╨╛╨╣ ╤Г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А╨░ ╨╜╨╡╨┐╤А╨╡╤А╤Л╨▓╨╜╨╛╨│╨╛ ╤З╨░╤Б╤В╨╛╤В╨╜╨╛-╨╝╨╛╨┤╤Г╨╗╨╕╤А╨╛╨▓╨░╨╜╨╜╨╛╨│╨╛ ╤Б╨╕╨│╨╜╨░╨╗╨░, ╨║╨╛╤В╨╛╤А╤Л╨╣, ╨╛╤В╤А╨░╨╢╨░╤П╤Б╤М ╨╛╤В ╨┐╨╛╨▓╨╡╤А╤Е╨╜╨╛╤Б╤В╨╕ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л, ╨┐╤А╨╕╨╜╨╕╨╝╨░╨╡╤В╤Б╤П ╨░╨╜╤В╨╡╨╜╨╜╨╛╨╣ ╤Г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А╨░ ╤Б ╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨╣ ╨╖╨░╨┤╨╡╤А╨╢╨║╨╛╨╣. ╨Ш╤Б╨┐╨╛╨╗╤М╨╖╤Г╤П ╤А╨░╨╖╨╜╨╛╤Б╤В╤М ╤З╨░╤Б╤В╨╛╤В ╨╕╨╖╨╗╤Г╤З╨░╨╡╨╝╨╛╨│╨╛ ╨╕ ╨┐╤А╨╕╨╜╨╕╨╝╨░╨╡╨╝╨╛╨│╨╛ ╤Б╨╕╨│╨╜╨░╨╗╨╛╨▓, ╨▓╤Л╤З╨╕╤Б╨╗╤П╨╡╤В╤Б╤П ╨╖╨╜╨░╤З╨╡╨╜╨╕╨╡ ╤Г╤А╨╛╨▓╨╜╤П ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л.	╨г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А ╤А╨░╨┤╨░╤А╨╜╤Л╨╣ ╨Ь╨Ч╨Ь-╨а╨г-1 ╨┐╤А╨╡╨┤╨╜╨░╨╖╨╜╨░╤З╨╡╨╜ ╨┤╨╗╤П ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П ╤Г╤А╨╛╨▓╨╜╤П ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╕ (╨▓ ╤В╨╛╨╝ ╤З╨╕╤Б╨╗╨╡ ╤Б╨╢╨╕╨╢╨╡╨╜╨╜╤Л╤Е ╨│╨░╨╖╨╛╨▓) ╨╕ ╤Б╤Л╨┐╤Г╤З╨╕╤Е ╨╝╨░╤В╨╡╤А╨╕╨░╨╗╨╛╨▓ ╨┐╤А╨╕ ╨░╤В╨╝╨╛╤Б╤Д╨╡╤А╨╜╨╛╨╝ ╨╕ ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╨╝ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╕.	231231231	t
8	╨Ь╨Ч╨Ь-╨н╨а-1 ╤Н╨╗╨╡╨║╤В╤А╨╛╨╝╨░╨│╨╜╨╕╤В╨╜╨╛╨│╨╛ ╤А╨░╤Б╤Е╨╛╨┤╨░	99999	╨Ф╨░╤В╤З╨╕╨║ ╤А╨░╤Б╤Е╨╛╨┤╨░	╨н╨╗╨╡╨║╤В╤А╨╛╨╝╨░╨│╨╜╨╕╤В╨╜╤Л╨╣ ╤А╨░╤Б╤Е╨╛╨┤	╨н╨╗╨╡╨║╤В╤А╨╛╨╝╨░╨│╨╜╨╕╤В╨╜╤Л╨╣ ╤А╨░╤Б╤Е╨╛╨┤.png	╨н╨╗╨╡╨║╤В╤А╨╛╨╝╨░╨│╨╜╨╕╤В╨╜╤Л╨╡ ╤А╨░╤Б╤Е╨╛╨┤╨╛╨╝╨╡╤А╤Л-╤Б╤З╨╡╤В╤З╨╕╨║╨╕ ╨н╨Ь╨Ш╨б-╨Ь╨Р╨У 270 ╨┐╤А╨╡╨┤╨╜╨░╨╖╨╜╨░╤З╨╡╨╜╤Л ╨┤╨╗╤П ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╨╣ ╨╛╨▒╤К╨╡╨╝╨╜╨╛╨│╨╛ ╤А╨░╤Б╤Е╨╛╨┤╨░ ╤Н╨╗╨╡╨║╤В╤А╨╛╨┐╤А╨╛╨▓╨╛╨┤╨╜╤Л╤Е ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╡╨╣ ╨▓ ╨┐╤А╤П╨╝╨╛╨╝ ╨╕ ╨╛╨▒╤А╨░╤В╨╜╨╛╨╝ ╨╜╨░╨┐╤А╨░╨▓╨╗╨╡╨╜╨╕╨╕ ╨┐╨╛╤В╨╛╨║╨░. ╨Т ╤В╨╛╨╝ ╤З╨╕╤Б╨╗╨╡ ╨░╨│╤А╨╡╤Б╤Б╨╕╨▓╨╜╤Л╤Е, ╨┤╨▓╤Г╤Е╨║╨╛╨╝╨┐╨╛╨╜╨╡╨╜╤В╨╜╤Л╤Е ╨╕ ╨╖╨░╨│╤А╤П╨╖╨╜╨╡╨╜╨╜╤Л╤Е ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╡╨╣ ╤Б ╤В╨▓╨╡╤А╨┤╤Л╨╝╨╕ ╨▓╨║╨╗╤О╤З╨╡╨╜╨╕╤П╨╝╨╕.\r\n\r\n╨Я╤А╨╕╨╝╨╡╨╜╤П╤О╤В╤Б╤П ╨▓ ╨╜╨╡╤Д╤В╤П╨╜╨╛╨╣, ╤Е╨╕╨╝╨╕╤З╨╡╤Б╨║╨╛╨╣, ╨╜╨╡╤Д╤В╨╡╤Е╨╕╨╝╨╕╤З╨╡╤Б╨║╨╛╨╣, ╨╝╨╡╤В╨░╨╗╨╗╤Г╤А╨│╨╕╤З╨╡╤Б╨║╨╛╨╣, ╨┐╨╕╤Й╨╡╨▓╨╛╨╣ ╨┐╤А╨╛╨╝╤Л╤И╨╗╨╡╨╜╨╜╨╛╤Б╤В╨╕ ╨╕ ╨▓ ╨║╨╛╨╝╨╝╤Г╨╜╨░╨╗╤М╨╜╨╛╨╝ ╤Е╨╛╨╖╤П╨╣╤Б╤В╨▓╨╡	╨Ш╨╖╨╝╨╡╤А╨╡╨╜╨╕╨╡ ╤А╨░╤Б╤Е╨╛╨┤╨░ ╤Н╨╗╨╡╨║╤В╤А╨╛╨┐╤А╨╛╨▓╨╛╨┤╨╜╤Л╤Е ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╡╨╣, ╨▓ ╤В╨╛╨╝ ╤З╨╕╤Б╨╗╨╡ ╨╖╨░╨│╤А╤П╨╖╨╜╨╡╨╜╨╜╤Л╤Е ╨╕ ╨░╨│╤А╨╡╤Б╤Б╨╕╨▓╨╜╤Л╤Е ╤Б╤А╨╡╨┤ ╤Н╨╗╨╡╨║╤В╤А╨╛╨╝╨░╨│╨╜╨╕╤В╨╜╤Л╨╝ ╤А╨░╤Б╤Е╨╛╨┤╨╛╨╝╨╡╤А╨╛╨╝.	1232311	t
6	╨Ь╨Ч╨Ь-╨Т╨а-1 ╨▓╤Л╤Б╨╛╨║╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П	50000	╨Ф╨░╤В╤З╨╕╨║ ╤А╨░╤Б╤Е╨╛╨┤╨░	╨Т╨╕╤Е╤А╨╡╨▓╨╛╨╣ ╤А╨░╤Б╤Е╨╛╨┤	╨Т╨╕╤Е╤А╨╡╨▓╨╛╨╣ ╤А╨░╤Б╤Е╨╛╨┤ ╨▓╤Л╤Б╨╛╨║╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П.png	╨Я╤А╨╕╨╜╤Ж╨╕╨┐ ╨╡╨│╨╛ ╤А╨░╨▒╨╛╤В╤Л ╨╖╨░╨║╨╗╤О╤З╨░╨╡╤В╤Б╤П ╨▓ ╤Б╨╗╨╡╨┤╤Г╤О╤Й╨╡╨╝: ╤Н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╤Л╨╣ ╨▒╨╗╨╛╨║ ╤Д╨╛╤А╨╝╨╕╤А╤Г╨╡╤В ╨╜╨░ ╨┤╨░╤В╤З╨╕╨║╨╡-╨╕╨╖╨╗╤Г╤З╨░╤В╨╡╨╗╨╡ ╨▓╤Л╤Б╨╛╨║╨╛╤З╨░╤Б╤В╨╛╤В╨╜╤Л╨╣ ╤Г╨╗╤М╤В╤А╨░╨╖╨▓╤Г╨║╨╛╨▓╨╛╨╣ ╤Б╨╕╨│╨╜╨░╨╗, ╨║╨╛╤В╨╛╤А╤Л╨╣ ╨┐╤А╨╛╤Е╨╛╨┤╤П ╤З╨╡╤А╨╡╨╖ ╨▓╨╕╤Е╤А╨╡╨▓╤Г╤О ╨┤╨╛╤А╨╛╨╢╨║╤Г, ╨╝╨╛╨┤╤Г╨╗╨╕╤А╤Г╨╡╤В╤Б╤П ╨┐╨╛ ╤Д╨░╨╖╨╡ ╨╕ ╨┐╨╛╤Б╤В╤Г╨┐╨░╨╡╤В ╨╜╨░ ╨┤╨░╤В╤З╨╕╨║ ╨┐╤М╨╡╨╖╨╛╨┐╤А╨╕╨╡╨╝╨╜╨╕╨║╨░. ╨в╨░╨║╨╛╨╣ ╨╝╨╡╤В╨╛╨┤ ╨╛╨▒╨╡╤Б╨┐╨╡╤З╨╕╨▓╨░╨╡╤В ╨▓╨╕╨▒╤А╨╛╤Г╤Б╤В╨╛╨╣╤З╨╕╨▓╨╛╤Б╤В╤М ╨╕ ╤А╨░╤Б╤И╨╕╤А╤П╨╡╤В ╨┤╨╕╨╜╨░╨╝╨╕╤З╨╡╤Б╨║╨╕╨╣ ╨┤╨╕╨░╨┐╨░╨╖╨╛╨╜ (╨┤╨╛ ╨╖╨╜╨░╤З╨╡╨╜╨╕╤П 1:100).\r\n\r\n╨в╨░╨║╨╢╨╡ ╨┤╨╗╤П ╤А╨░╤Б╤Е╨╛╨┤╨╛╨╝╨╡╤А╨░ ╨▓╨╜╨╡╨┤╤А╨╡╨╜╨░ ╨░╨▓╤В╨╛╨╝╨░╤В╨╕╤З╨╡╤Б╨║╨░╤П ╨┐╨╛╨┤╤Б╤В╤А╨╛╨╣╨║╨░ ╤Г╤А╨╛╨▓╨╜╤П ╤Б╨╕╨│╨╜╨░╨╗╨╛╨▓, ╨┐╨╛╨╖╨▓╨╛╨╗╤П╤О╤Й╨░╤П ╨║╨╛╨╝╨┐╨╡╨╜╤Б╨╕╤А╨╛╨▓╨░╤В╤М ╨╖╨░╨│╤А╤П╨╖╨╜╨╡╨╜╨╕╤П ╤Б╨╡╨╜╤Б╨╛╤А╨╛╨▓ ╨╕ ╨╕╤Е ╨┤╨╡╨│╤А╨░╨┤╨░╤Ж╨╕╤О ╨┐╨╛ ╨╝╨╡╤А╨╡ ╤Б╤В╨░╤А╨╡╨╜╨╕╤П ╨┐╤А╨╕╨▒╨╛╤А╨░.\r\n\r\n╨Т ╨▒╨░╨╖╨╛╨▓╨╛╨╣ ╨▓╨╡╤А╤Б╨╕╨╕ ╤Н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╤Л╨╣ ╨▒╨╗╨╛╨║ ╨┐╨╛╤Б╤В╨░╨▓╨╗╤П╨╡╤В╤Б╤П ╤Б ╤З╨░╤Б╤В╨╛╤В╨╜╨╛/╨╕╨╝╨┐╤Г╨╗╤М╤Б╨╜╤Л╨╝ ╨▓╤Л╤Е╨╛╨┤╨╛╨╝ ╨╕ ╤Ж╨╕╤Д╤А╨╛╨▓╤Л╨╝ ╨▓╤Л╤Е╨╛╨┤╨╜╤Л╨╝ ╤Б╨╕╨│╨╜╨░╨╗╨╛╨╝ Modbus ╤Б ╨╕╨╜╤В╨╡╤А╤Д╨╡╨╣╤Б╨╛╨╝ RS-485. ╨Ю╨┤╨╜╨░╨║╨╛, ╨┐╨╛ ╨╢╨╡╨╗╨░╨╜╨╕╤О ╨╖╨░╨║╨░╨╖╤З╨╕╨║╨░, ╨┐╤А╨╕╨▒╨╛╤А╤Л ╨╝╨╛╨│╤Г╤В ╨▒╤Л╤В╤М ╨╕╨╖╨│╨╛╤В╨╛╨▓╨╗╨╡╨╜╤Л ╤Б ╤З╨╡╤В╤Л╤А╨╡╤Е╤Б╤В╤А╨╛╤З╨╜╤Л╨╝ OLED-╨╕╨╜╨┤╨╕╨║╨░╤В╨╛╤А╨╛╨╝, ╨░╨╜╨░╨╗╨╛╨│╨╛╨▓╤Л╨╝ ╨▓╤Л╤Е╨╛╨┤╨╜╤Л╨╝ ╤Б╨╕╨│╨╜╨░╨╗╨╛╨╝ ╨╕ ╤Ж╨╕╤Д╤А╨╛╨▓╤Л╨╝ ╨┐╤А╨╛╤В╨╛╨║╨╛╨╗╨╛╨╝ HART.\r\n\r\n╨Т╨╖╤А╤Л╨▓╨╛╨╖╨░╤Й╨╕╤Й╨╡╨╜╨╜╨╛╨╡ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╨╡ ╨╕ ╤И╨╕╤А╨╛╨║╨╕╨╣ ╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨╜╤Л╨╣ ╨┤╨╕╨░╨┐╨░╨╖╨╛╨╜ (╨╛╤В -60 ╨┤╨╛ +70 ┬║C) ╨┐╨╛╨╖╨▓╨╛╨╗╤П╤О╤В ╤Н╨║╤Б╨┐╨╗╤Г╨░╤В╨╕╤А╨╛╨▓╨░╤В╤М ╤А╨░╤Б╤Е╨╛╨┤╨╛╨╝╨╡╤А ╨▓ ╤Н╨║╤Б╤В╤А╨╡╨╝╨░╨╗╤М╨╜╤Л╤Е ╤Г╤Б╨╗╨╛╨▓╨╕╤П╤Е.\r\n\r\n╨Ю╨╜ ╨┐╤А╨╡╨┤╨╜╨░╨╖╨╜╨░╤З╨╡╨╜ ╨┤╨╗╤П ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╤П ╨╛╨▒╤К╨╡╨╝╨░ ╨╕ ╨╛╨▒╤К╨╡╨╝╨╜╨╛╨│╨╛ ╤А╨░╤Б╤Е╨╛╨┤╨░ ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╡╨╣ ╨▓ ╤В╤А╤Г╨▒╨╛╨┐╤А╨╛╨▓╨╛╨┤╨░╤Е ╤Б╨╕╤Б╤В╨╡╨╝ ╨Я╨Я╨Ф (╨┐╨╛╨┤╨┤╨╡╤А╨╢╨░╨╜╨╕╤П ╨┐╨╗╨░╤Б╤В╨╛╨▓╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П), ╨░ ╤В╨░╨║╨╢╨╡ ╨┤╤А╤Г╨│╨╕╤Е ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╡╨╣ ╨┐╤А╨╕ ╨▓╤Л╤Б╨╛╨║╨╛╨╝ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╕.	╨Я╤А╨╡╨╛╨▒╤А╨░╨╖╨╛╨▓╨░╤В╨╡╨╗╨╕ ╤А╨░╤Б╤Е╨╛╨┤╨░ ╨╝╨╛╨│╤Г╤В ╨╕╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╤В╤М╤Б╤П ╨▓ ╤Б╨╛╤Б╤В╨░╨▓╨╡ ╨░╨▓╤В╨╛╨╝╨░╤В╨╕╤З╨╡╤Б╨║╨╕╤Е ╤Б╨╕╤Б╤В╨╡╨╝ ╤Г╨┐╤А╨░╨▓╨╗╨╡╨╜╨╕╤П ╨╕ ╨║╨╛╨╜╤В╤А╨╛╨╗╤П, ╨╗╨╛╨║╨░╨╗╤М╨╜╤Л╤Е ╤Б╤Е╨╡╨╝╨░╤Е ╨░╨▓╤В╨╛╨╝╨░╤В╨╕╨╖╨░╤Ж╨╕╨╕ ╤Б ╨╕╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╨╜╨╕╨╡╨╝ ╤З╨░╤Б╤В╨╛╤В╨╜╨╛-╨╕╨╝╨┐╤Г╨╗╤М╤Б╨╜╨╛╨│╨╛ ╤Б╨╕╨│╨╜╨░╨╗╨░, ╤В╨╛╨║╨╛╨▓╨╛╨│╨╛ ╤Б╨╕╨│╨╜╨░╨╗╨░ ╨╕ ╤Ж╨╕╤Д╤А╨╛╨▓╨╛╨│╨╛ ╤Б╨╕╨│╨╜╨░╨╗╨░ ModBus (RS485) ╨╕ HART.	123456	t
\.


--
-- Data for Name: item_properties; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.item_properties (id, name) FROM stdin;
1	╨Ш╨╖╨╝╨╡╤А╤П╨╡╨╝╨░╤П ╤Б╤А╨╡╨┤╨░
2	╨б╨┐╨╡╤Ж. ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╨╡
3	╨Т╨╖╤А╤Л╨▓╨╛╨╖╨░╤Й╨╕╤В╨░
4	╨Т╤Л╤Е╨╛╨┤╨╜╤Л╨╡ ╤Б╨╕╨│╨╜╨░╨╗╤Л
5	╨Ф╨╛╨╗╨│╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨░╤П ╤Б╤В╨░╨▒╨╕╨╗╤М╨╜╨╛╤Б╤В╤М
6	╨а╨░╨▒╨╛╤З╨░╤П ╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░, ┬░╨б
7	╨Ф╨╕╨░╨┐╨░╨╖╨╛╨╜ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╤Л╤Е ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╣ (╨╝╨╕╨╜, ╨╝╨░╨║╤Б), ╨Ь╨Я╨░
8	╨Э╨░╨┐╤А╤П╨╢╨╡╨╜╨╕╨╡ ╨┐╨╕╤В╨░╨╜╨╕╤П, ╨Т
9	╨Я╨╛╨│╤А╨╡╤И╨╜╨╛╤Б╤В╤М, %
10	╨в╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л, ┬░╨б
11	╨в╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░ ╨╛╨║╤А╤Г╨╢╨░╤О╤Й╨╡╨╣ ╤Б╤А╨╡╨┤╤Л, ┬░╨б
12	╨Ф╨╕╨░╨┐╨░╨╖╨╛╨╜ ╨┐╨╡╤А╨╡╨╜╨░╤Б╤В╤А╨╛╨╣╨║╨╕
13	╨Ь╨░╤В╨╡╤А╨╕╨░╨╗ ╨╝╨╡╨╝╨▒╤А╨░╨╜╤Л ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨░
14	╨Ч╨░╨┐╨╛╨╗╨╜╤П╤О╤Й╨░╤П ╨╢╨╕╨┤╨║╨╛╤Б╤В╤М
15	╨Ь╨░╤В╨╡╤А╨╕╨░╨╗ ╨║╨╛╤А╨┐╤Г╤Б╨░ ╤Н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╨╛╨│╨╛ ╨▒╨╗╨╛╨║╨░
16	╨Ь╨╡╨╢╨┐╨╛╨▓╨╡╤А╨╛╤З╨╜╤Л╨╣ ╨╕╨╜╤В╨╡╤А╨▓╨░╨╗
17	╨Я╤Л╨╗╨╡╨▓╨╗╨░╨│╨╛╨╖╨░╤Й╨╕╤В╨░
18	╨в╨╡╤Е╨╜╨╛╨╗╨╛╨│╨╕╤З╨╡╤Б╨║╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡
19	╨Т╨╕╨▒╤А╨╛╤Б╤В╨╛╨╣╨║╨╛╤Б╤В╤М
20	╨Ф╨╕╨░╨╝╨╡╤В╤А ╤Г╤Б╨╗╨╛╨▓╨╜╨╛╨│╨╛ ╨┐╤А╨╛╤Е╨╛╨┤╨░, ╨╝╨╝
21	╨в╨╕╨┐╨╛╤А╨░╨╖╨╝╨╡╤А
22	╨з╨░╤Б╤В╨╛╤В╨░
23	╨Ф╨╕╤Н╨╗╨╡╨║╤В╤А╨╕╤З╨╡╤Б╨║╨░╤П ╨┐╤А╨╛╨╜╨╕╤Ж╨░╨╡╨╝╨╛╤Б╤В╤М ╤Б╤А╨╡╨┤╤Л
24	╨Ъ╨░╨▒╨╡╨╗╤М╨╜╤Л╨╡ ╨▓╨▓╨╛╨┤╤Л
\.


--
-- Data for Name: item_properties_values; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.item_properties_values (item_id, property_id, value) FROM stdin;
1	1	╨У╨░╨╖,╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М,╨Я╨░╤А
1	2	╨Т╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡,╨Т╤Л╤Б╨╛╨║╨╛╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨╜╨╛╨╡,╨Ъ╨╕╤Б╨╗╨╛╤А╨╛╨┤╨╜╨╛╨╡,╨Ъ╤А╨╕╨╛╨│╨╡╨╜╨╜╨╛╨╡,╨Ь╨╛╤А╤Б╨║╨╛╨╡,╨Я╨╕╤Й╨╡╨▓╨╛╨╡,╨а╤Г╨┤╨╜╨╕╤З╨╜╨╛╨╡,╨б╨╡╤А╨╛╨▓╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡,╨е╨╗╨╛╤А╨╜╨╛╨╡
1	3	1Ex d IIC T6тАжT4 Gb X,1Ex d ia IIC T6тАжT4 Gb X,0Ex ia IIB T6тАжT4 Ga X,0Ex ia IIC T6тАжT4 Ga X,PO Ex ia I Ma X,PB Ex d I Mb X,PB Ex d ia I Mb X
1	4	4-20╨╝╨Р + HART ╤Б ╨╜╨░╨╗╨╕╤З╨╕╨╡╨╝ DD
1	5	╨Э╨╡ ╨▒╨╛╨╗╨╡╨╡ 0,1% ╨▓ ╤В╨╡╤З╨╡╨╜╨╕╨╡ 10 ╨╗╨╡╤В
1	6	-120...+700
1	7	0..40
1	8	10.5...45
1	9	┬▒0.04,0.065,0.1,0.2 
1	10	-90...+230 (╤Б ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╨╡╨╝ ╤Б╤А╨╡╨┤)
1	11	-60..+85
1	12	╨┤╨╛ 100:1
1	13	╨Э╨╡╤А╨╢╨░╨▓╨╡╤О╤Й╨░╤П ╤Б╤В╨░╨╗╤М 316L,╤Б╨┐╨╗╨░╨▓ ╨е╨░╤Б╤В╨╡╨╗╨╗╨╛╨╣,╨в╨░╨╜╤В╨░╨╗,╨Ь╨╛╨╜╨╡╨╗╤М,╨Э╨╕╨║╨╡╨╗╤М,316L ╤Б ╨╖╨╛╨╗╨╛╤В╤Л╨╝ ╨╜╨░╨┐╤Л╨╗╨╡╨╜╨╕╨╡╨╝
1	14	╨б╨╕╨╗╨╕╨║╨╛╨╜╨╛╨▓╨╛╨╡ ╨╝╨░╤Б╨╗╨╛, ╨Ш╨╜╨╡╤А╤В╨╜╨╛╨╡ ╨╝╨░╤Б╨╗╨╛
1	15	╨Р╨╗╤О╨╝╨╕╨╜╨╕╨╣,╨Р╨╗╤О╨╝╨╕╨╜╨╕╨╣ ╤Б ╨╖╨░╤Й╨╕╤В╨╜╤Л╨╝ ╤Б╨╗╨╛╨╡╨╝,╨Э╨╡╤А╨╢╨░╨▓╨╡╤О╤Й╨░╤П ╤Б╤В╨░╨╗╤М
1	16	6 ╨╗╨╡╤В
1	17	IP65,IP66,IP67,IP68
1	18	╨Ь20╤Е1.5,╨Ь44╤Е1.25,G1/2 ╨╜╨░╤А╤Г╨╢╨╜╨░╤П ╤А╨╡╨╖╤М╨▒╨░,1тАЭ ╨▒╨╡╨╖╤А╨╡╨╖╤М╨▒╨╛╨▓╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡,1/2NPT ╨╜╨░╤А╤Г╨╢╨╜╨░╤П/╨▓╨╜╤Г╤В╤А╨╡╨╜╨╜╤П╤П ╤А╨╡╨╖╤М╨▒╨░ ╨┤╨╗╤П ╨┤╨░╤В╤З╨╕╨║╨╛╨▓ ╤И╤В╤Г╤Ж╨╡╤А╨╜╨╛╨│╨╛ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П,1/4NPT ╤Д╨╗╨░╨╜╤Ж╨╡╨▓╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡ ╨┤╨╗╤П ╨┤╨░╤В╤З╨╕╨║╨╛╨▓ ╤Д╨╗╨░╨╜╤Ж╨╡╨▓╨╛╨│╨╛ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П.
1	19	V2,G2 ╨┐╨╛ ╨У╨Ю╨б╨в ╨а 52931-2008
3	1	╨У╨░╨╖, ╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М, ╨Я╨░╤А
3	2	╨Т╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡, ╨Т╤Л╤Б╨╛╨║╨╛╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨╜╨╛╨╡, ╨Ъ╨╕╤Б╨╗╨╛╤А╨╛╨┤╨╜╨╛╨╡, ╨Ъ╤А╨╕╨╛╨│╨╡╨╜╨╜╨╛╨╡, ╨Ь╨╛╤А╤Б╨║╨╛╨╡, ╨Я╨╕╤Й╨╡╨▓╨╛╨╡, ╨а╤Г╨┤╨╜╨╕╤З╨╜╨╛╨╡, ╨б╨╡╤А╨╛╨▓╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡, ╨е╨╗╨╛╤А╨╜╨╛╨╡
3	3	1Ex d IIC T6тАжT4 Gb X, 1Ex d ia IIC T6тАжT4 Gb X, 0Ex ia IIB T6тАжT4 Ga X, 0Ex ia IIC T6тАжT4 Ga X, PO Ex ia I Ma X, PB Ex d I Mb X, PB Ex d ia I Mb X
3	4	4-20 ╨╝╨Р + HART ╤Б ╨╜╨░╨╗╨╕╤З╨╕╨╡╨╝ DD
3	5	╨Э╨╡ ╨▒╨╛╨╗╨╡╨╡ 0,1% ╨▓ ╤В╨╡╤З╨╡╨╜╨╕╨╡ 10 ╨╗╨╡╤В
3	6	-40...+120
3	7	0..69
3	8	10.5...45 
3	9	┬▒0.065, 0.1, 0.2 
3	10	-90...+700 (╤Б ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╨╡╨╝ ╤Б╤А╨╡╨┤)
3	11	-60...+85 ╤Б ╤Б╨╛╤Е╤А╨░╨╜. ╨▓╨╖╤А╤Л╨▓╨╛╨╖╨░╤Й╨╕╤В╤Л
3	12	╨┤╨╛ 100:1
3	13	╨Э╨╡╤А╨╢╨░╨▓╨╡╤О╤Й╨░╤П ╤Б╤В╨░╨╗╤М 316L, ╤Б╨┐╨╗╨░╨▓ ╨е╨░╤Б╤В╨╡╨╗╨╗╨╛╨╣, ╨в╨░╨╜╤В╨░╨╗, ╨Ь╨╛╨╜╨╡╨╗╤М, ╨Э╨╕╨║╨╡╨╗╤М, 316L ╤Б ╨╖╨╛╨╗╨╛╤В╤Л╨╝ ╨╜╨░╨┐╤Л╨╗╨╡╨╜╨╕╨╡╨╝
3	14	╨б╨╕╨╗╨╕╨║╨╛╨╜╨╛╨▓╨╛╨╡ ╨╝╨░╤Б╨╗╨╛, ╨Ш╨╜╨╡╤А╤В╨╜╨╛╨╡ ╨╝╨░╤Б╨╗╨╛
3	15	╨Р╨╗╤О╨╝╨╕╨╜╨╕╨╣, ╨Р╨╗╤О╨╝╨╕╨╜╨╕╨╣ ╤Б ╨╖╨░╤Й╨╕╤В╨╜╤Л╨╝ ╤Б╨╗╨╛╨╡╨╝, ╨Э╨╡╤А╨╢╨░╨▓╨╡╤О╤Й╨░╤П ╤Б╤В╨░╨╗╤М
3	16	6 ╨╗╨╡╤В
3	17	IP65, IP66, IP67, IP68
3	18	╨Ь20╤Е1.5, ╨Ь44╤Е1.25, G1/2 ╨╜╨░╤А╤Г╨╢╨╜╨░╤П ╤А╨╡╨╖╤М╨▒╨░, 1тАЭ ╨▒╨╡╨╖╤А╨╡╨╖╤М╨▒╨╛╨▓╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡. 1/2NPT ╨╜╨░╤А╤Г╨╢╨╜╨░╤П/╨▓╨╜╤Г╤В╤А╨╡╨╜╨╜╤П╤П ╤А╨╡╨╖╤М╨▒╨░ ╨┤╨╗╤П ╨┤╨░╤В╤З╨╕╨║╨╛╨▓ ╤И╤В╤Г╤Ж╨╡╤А╨╜╨╛╨│╨╛ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П, 1/4NPT ╤Д╨╗╨░╨╜╤Ж╨╡╨▓╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡ ╨┤╨╗╤П ╨┤╨░╤В╤З╨╕╨║╨╛╨▓ ╤Д╨╗╨░╨╜╤Ж╨╡╨▓╨╛╨│╨╛ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П
3	19	G2 ╨┐╨╛ ╨У╨Ю╨б╨в ╨а 52931-2008
4	1	╨У╨░╨╖, ╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М, ╨Я╨░╤А
4	2	╨Т╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡, ╨Т╤Л╤Б╨╛╨║╨╛╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨╜╨╛╨╡, ╨Ъ╨╕╤Б╨╗╨╛╤А╨╛╨┤╨╜╨╛╨╡, ╨Ъ╤А╨╕╨╛╨│╨╡╨╜╨╜╨╛╨╡, ╨Ь╨╛╤А╤Б╨║╨╛╨╡, ╨Я╨╕╤Й╨╡╨▓╨╛╨╡, ╨а╤Г╨┤╨╜╨╕╤З╨╜╨╛╨╡, ╨б╨╡╤А╨╛╨▓╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡, ╨е╨╗╨╛╤А╨╜╨╛╨╡
4	3	1Ex d IIC T6тАжT4 Gb X, 1Ex d ia IIC T6тАжT4 Gb X, 0Ex ia IIB T6тАжT4 Ga X, 0Ex ia IIC T6тАжT4 Ga X, PO Ex ia I Ma X, PB Ex d I Mb X, PB Ex d ia I Mb X
4	4	4-20 ╨╝╨Р + HART ╤Б ╨╜╨░╨╗╨╕╤З╨╕╨╡╨╝ DD
4	5	╨Э╨╡ ╨▒╨╛╨╗╨╡╨╡ 0.1% ╨▓ ╤В╨╡╤З╨╡╨╜╨╕╨╡ 10 ╨╗╨╡╤В
4	6	-40...+120
4	7	0..69
4	8	10.5...45
4	9	┬▒0.065, 0.1, 0.2 
4	10	60..+85
4	11	-60..+85
4	12	╨┤╨╛ 100:1
4	13	╨Э╨╡╤А╨╢╨░╨▓╨╡╤О╤Й╨░╤П ╤Б╤В╨░╨╗╤М 316L, ╤Б╨┐╨╗╨░╨▓ ╨е╨░╤Б╤В╨╡╨╗╨╗╨╛╨╣, ╨в╨░╨╜╤В╨░╨╗, ╨Ь╨╛╨╜╨╡╨╗╤М, ╨Э╨╕╨║╨╡╨╗╤М, 316L ╤Б ╨╖╨╛╨╗╨╛╤В╤Л╨╝ ╨╜╨░╨┐╤Л╨╗╨╡╨╜╨╕╨╡╨╝
4	14	╨б╨╕╨╗╨╕╨║╨╛╨╜╨╛╨▓╨╛╨╡ ╨╝╨░╤Б╨╗╨╛, ╨Ш╨╜╨╡╤А╤В╨╜╨╛╨╡ ╨╝╨░╤Б╨╗╨╛
4	15	╨Р╨╗╤О╨╝╨╕╨╜╨╕╨╣, ╨Р╨╗╤О╨╝╨╕╨╜╨╕╨╣ ╤Б ╨╖╨░╤Й╨╕╤В╨╜╤Л╨╝ ╤Б╨╗╨╛╨╡╨╝, ╨Э╨╡╤А╨╢╨░╨▓╨╡╤О╤Й╨░╤П ╤Б╤В╨░╨╗╤М
4	16	6 ╨╗╨╡╤В
4	17	IP65,IP66,IP67,IP68
4	18	╨Ь20╤Е1.5, ╨Ь44╤Е1.25, G1/2 ╨╜╨░╤А╤Г╨╢╨╜╨░╤П ╤А╨╡╨╖╤М╨▒╨░, 1тАЭ ╨▒╨╡╨╖╤А╨╡╨╖╤М╨▒╨╛╨▓╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡, 1/2NPT ╨╜╨░╤А╤Г╨╢╨╜╨░╤П/╨▓╨╜╤Г╤В╤А╨╡╨╜╨╜╤П╤П ╤А╨╡╨╖╤М╨▒╨░ ╨┤╨╗╤П ╨┤╨░╤В╤З╨╕╨║╨╛╨▓ ╤И╤В╤Г╤Ж╨╡╤А╨╜╨╛╨│╨╛ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П, 1/4NPT ╤Д╨╗╨░╨╜╤Ж╨╡╨▓╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡ ╨┤╨╗╤П ╨┤╨░╤В╤З╨╕╨║╨╛╨▓ ╤Д╨╗╨░╨╜╤Ж╨╡╨▓╨╛╨│╨╛ ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П.
4	19	G2 ╨┐╨╛ ╨У╨Ю╨б╨в ╨а 52931-2008
5	1	╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М
5	2	╨б╨╡╤А╨╛╨▓╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡
5	3	1 Exd IIC T5 Gb X
5	4	╨з╨░╤Б╤В╨╛╤В╨╜╨╛-╨╕╨╝╨┐╤Г╨╗╤М╤Б╨╜╤Л╨╣, ╨Р╨╜╨░╨╗╨╛╨│╨╛╨▓╤Л╨╣: ╤В╨╛╨║╨╛╨▓╤Л╨╣ 4тАж20╨╝╨Р, ╨ж╨╕╤Д╤А╨╛╨▓╨╛╨╣: RS-485 ╤Б ╨┐╤А╨╛╤В╨╛╨║╨╛╨╗╨╛╨╝ Modbus RTU, HART, USB (╤В╨╡╤Е╨╜╨╛╨╗╨╛╨│╨╕╤З╨╡╤Б╨║╨╕╨╣)
5	8	┬▒1.0, ┬▒1.5, ┬▒3.0
5	9	0...+100
5	10	-60...+70
5	11	-60...+70
5	16	4 ╨│╨╛╨┤╨░
5	17	IP 66/68
5	20	50, 80, 100, 150
7	1	╨У╨░╨╖, ╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М, ╨Я╨░╤А
7	2	╨Т╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡, ╨Т╤Л╤Б╨╛╨║╨╛╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨╜╨╛╨╡, ╨Ъ╨╕╤Б╨╗╨╛╤А╨╛╨┤╨╜╨╛╨╡, ╨Ъ╤А╨╕╨╛╨│╨╡╨╜╨╜╨╛╨╡, ╨Ь╨╛╤А╤Б╨║╨╛╨╡, ╨Я╨╕╤Й╨╡╨▓╨╛╨╡, ╨а╤Г╨┤╨╜╨╕╤З╨╜╨╛╨╡, ╨б╨╡╤А╨╛╨▓╨╛╨┤╨╛╤А╨╛╨┤╨╜╨╛╨╡, ╨е╨╗╨╛╤А╨╜╨╛╨╡
7	3	1 Exd IIC (T1-T6) Gb X, 1 Exib IIB/II╨б (T1-T6) Gb X, 1 Exia IIB/II╨б (T1-T6) Gb X, 0 Exia IIB/IIC (T1-T6) Gb ╨е, ╨а╨Т Exib I╨Ьb ╨е, ╨а╨Ю Exia IMa ╨е, ╨а╨Т ExdI Mb ╨е
7	4	╨з╨░╤Б╤В╨╛╤В╨╜╨╛-╨╕╨╝╨┐╤Г╨╗╤М╤Б╨╜╤Л╨╣, ╨Р╨╜╨░╨╗╨╛╨│╨╛╨▓╤Л╨╣, ╤В╨╛╨║╨╛╨▓╤Л╨╣ 4тАж20╨╝╨Р, ╨ж╨╕╤Д╤А╨╛╨▓╨╛╨╣: RS-485 ╤Б ╨┐╤А╨╛╤В╨╛╨║╨╛╨╗╨╛╨╝ Modbus RTU, HART, USB (╤В╨╡╤Е╨╜╨╛╨╗╨╛╨│╨╕╤З╨╡╤Б╨║╨╕╨╣)
7	8	12-30
7	9	┬▒0,5,┬▒0,7
7	10	-200...+450
7	11	-60...+70
7	16	5 ╨╗╨╡╤В
7	17	IP 66/68, IP 66 (╤Г╤А╨╛╨▓╨╜╤П ╨а╨Т; ╨а╨Т╨Ш; ╨а╨Ю; ╨а╨Ю-╨а╨Т)
7	20	15...300
8	1	╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М
8	2	╨Ю╨▒╤К╤С╨╝
8	3	1Ex db IIC T6тАжT3 Gb X, 1Ex db [ia] IIC ╨в6тАж╨в3 Gb X, ╨а╨Т Ex db I Mb X, Ex tb IIIC T80┬░C...T180┬░C Db X
8	4	╨з╨░╤Б╤В╨╛╤В╨╜╨╛-╨╕╨╝╨┐╤Г╨╗╤М╤Б╨╜╤Л╨╣, ╨Р╨╜╨░╨╗╨╛╨│╨╛╨▓╤Л╨╣: ╤В╨╛╨║╨╛╨▓╤Л╨╣ 4тАж20╨╝╨Р, ╨ж╨╕╤Д╤А╨╛╨▓╨╛╨╣: RS-485 ╤Б ╨┐╤А╨╛╤В╨╛╨║╨╛╨╗╨╛╨╝ Modbus RTU, HART, ╨б╨╕╨│╨╜╨░╨╗ ╤В╤А╨╡╨▓╨╛╨│╨╕
8	8	24 ╨Т ╨┐╨╛╤Б╤В╨╛╤П╨╜╨╜╨╛╨│╨╛ ╤В╨╛╨║╨░, 220 ╨Т ╨┐╨╡╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤В╨╛╨║╨░
8	9	┬▒0.5
8	10	-40...+180
8	11	-60...+70
8	16	5 ╨╗╨╡╤В
8	17	IP 65, IP 66, IP 67, IP 66/67
8	20	15...600
9	1	╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М, ╨б╨╢╨╕╨╢╨╡╨╜╨╜╤Л╨╡ ╨│╨░╨╖╤Л, ╨б╤Л╨┐╤Г╤З╨╕╨╡
9	3	0Ex ia IIC T6тАжT1 Ga X, Ex ia IIIC T80┬░CтАжT450┬░C, 0Ex ia IIB T6тАжT1 Ga X, Ex ia IIIB T80┬░CтАжT450┬░C, 1Ex db IIC T6тАжT1 Gb X, Ex tb IIIC T80┬░C...T450┬░C, 1Ex db ia IIC T6...T1 Gb X.
9	4	╨Р╨╜╨░╨╗╨╛╨│╨╛╨▓╤Л╨╣ 4-20 ╨╝╨Р / ╤Ж╨╕╤Д╤А╨╛╨▓╨╛╨╣ HART v7
9	8	24 ╨Т ╨┐╨╛╤Б╤В╨╛╤П╨╜╨╜╨╛╨│╨╛, 220 ╨Т ╨┐╨╡╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛
9	10	╨╛╤В -60 ╨┤╨╛ +450
9	11	╨╛╤В -60тАж+85, -70 ┬░╨б ╨┤╨╛ +85 ┬░╨б ╤Б ╤В╨╡╤А╨╝╨╛╤З╨╡╤Е╨╗╨╛╨╝
9	17	IP66,IP67,IP68
9	15	╨Ъ╨╛╤А╨┐╤Г╤Б: ╨Р╨╗╤О╨╝╨╕╨╜╨╕╨╣ / ╨╜╨╡╤А╨╢╨░╨▓╨╡╤О╤Й╨░╤П ╤Б╤В╨░╨╗╤М. ╨Р╨╜╤В╨╡╨╜╨╜╨░: ╨б╤В╨░╨╗╨╕ тАУ 304/316; ╤Д╤В╨╛╤А╨╛╨┐╨╗╨░╤Б╤В тАУ PTFE (╨▓ ╨╖╨░╨▓╨╕╤Б╨╕╨╝╨╛╤Б╤В╨╕ ╨╛╤В ╤В╨╕╨┐╨░ ╨░╨╜╤В╨╡╨╜╨╜╤Л)
9	18	╨д╨╗╨░╨╜╤Ж╨╡╨▓╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡ ╨╛╤В ╨Ф╤Г50, ╤Д╨╗╨░╨╜╤Ж╤Л ╨У╨Ю╨б╨в/EN/ASME, ╨а╨╡╨╖╤М╨▒╨╛╨▓╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡ ╨╛╤В 1.5 ╨┤╤О╨╣╨╝╨╛╨▓, ╤В╨╕╨┐ ╤А╨╡╨╖╤М╨▒╤Л тАУ G ╨╕ NPT
9	22	6 ╨У╨У╤Ж тАУ ╨║╨╛╨╜╨╕╤З╨╡╤Б╨║╨╕╨╡/╤Б╤В╨╡╤А╨╢╨╜╨╡╨▓╤Л╨╡, 26 ╨У╨У╤Ж тАУ ╨║╨╛╨╜╨╕╤З╨╡╤Б╨║╨╕╨╡/╨┐╨░╤А╨░╨▒╨╛╨╗╨╕╤З╨╡╤Б╨║╨╕╨╡/╨┐╤А╨╛╤В╨╕╨▓╨╛╨║╨╛╤А╤А╨╛╨╖╨╕╨╛╨╜╨╜╤Л╨╡, 80 ╨У╨У╤Ж тАУ ╨╗╨╕╨╜╨╖╨╛╨▓╤Л╨╡ ╨░╨╜╤В╨╡╨╜╨╜╤Л
9	23	╨╛╤В 1.4 (╨▓ ╨╖╨░╨▓╨╕╤Б╨╕╨╝╨╛╤Б╤В╨╕ ╨╛╤В ╤В╨╕╨┐╨░ ╨░╨╜╤В╨╡╨╜╨╜╤Л ╨╕ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л)
10	1	╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М, ╨б╨╢╨╕╨╢╨╡╨╜╨╜╤Л╨╡ ╨│╨░╨╖╤Л, ╨б╤Л╨┐╤Г╤З╨╕╨╡
10	3	0Ex ia IIC T6тАжT1, Ga X 0Ex ia IIB T6тАжT1 Ga X,, 1Ex db IIC T6тАжT1 Gb X, 1Ex db ia IIC T6тАжT1 Gb X, Ex ia IIIC T80┬░тАж.T450┬░C Da X, Ex ia IIIB T80┬░тАж.T450┬░C Da X, Ex tb IIIC T80┬░тАж.T450┬░C Db X
10	4	╨Р╨╜╨░╨╗╨╛╨│╨╛╨▓╤Л╨╣: 4-20 ╨╝╨Р ╨ж╨╕╤Д╤А╨╛╨▓╨╛╨╣: HART v7 ╨┤╨╛╨┐╨╛╨╗╨╜╨╕╤В╨╡╨╗╤М╨╜╤Л╨╣ ╨░╨╜╨░╨╗╨╛╨│╨╛╨▓╤Л╨╣ ╨▓╤Л╤Е╨╛╨┤ 4-20 ╨╝╨Р:
10	8	╨┐╨╛╤Б╤В╨╛╤П╨╜╨╜╨╛╨│╨╛ ╤В╨╛╨║╨░ ╨╛╤В 18 ╨┤╨╛ 30, ╨┐╨╡╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤В╨╛╨║╨░ ╨╛╤В 187 ╨┤╨╛ 242 ╤З╨░╤Б╤В╨╛╤В╨░ ╨┐╨╡╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤В╨╛╨║╨░ 50┬▒1 ╨У╤Ж
10	10	╨╛╤В -196 ╨┤╨╛ +445
10	11	╨╛╤В -60тАж+80
10	17	IP66/IP67, IP66/IP68
10	15	
10	18	╨Р╨╜╤В╨╡╨╜╨╜╨░: ╨б╤В╨░╨╗╨╕ тАУ 304/316/12╨е18╨Э10╨в; ╤Д╤В╨╛╤А╨╛╨┐╨╗╨░╤Б╤В тАУ PTFE; ╨Ъ╨╛╤А╨┐╤Г╤Б: ╨Р╨╗╤О╨╝╨╕╨╜╨╕╨╣ / ╨╜╨╡╤А╨╢╨░╨▓╨╡╤О╤Й╨░╤П ╤Б╤В╨░╨╗╤М
10	22	~ 1 ╨У╨У╤Ж
10	23	╨╛╤В 1,4
\.


--
-- Data for Name: item_spec_files; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.item_spec_files (id, name, link, picture) FROM stdin;
1	╨а╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╛	╨Ф╨╛╨║╤Г╨╝╨╡╨╜╤В╨░╤Ж╨╕╤П ╨░╨▒╤Б╨╛╨╗╤О╤В╨╜╨╛╨╡ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡.pdf	logos/pdf_icon.png
3	╨а╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╛	╨Ф╨╛╨║╤Г╨╝╨╡╨╜╤В╨░╤Ж╨╕╤П ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╨╡ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡.pdf	logos/pdf_icon.png
4	╨а╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╛	╨Ф╨╛╨║╤Г╨╝╨╡╨╜╤В╨░╤Ж╨╕╤П ╨│╨╕╨┤╤А╨╛╤Б╤В╨░╤В╨╕╤З╨╡╤Б╨║╨╛╨╡ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡.pdf	logos/pdf_icon.png
5	╨а╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╛	╨▓╨╕╤Е╤А╨╡╨░╨║╤Г╤Б╤В╨╕╤З╨╡╤Б╨║╨╕╨╣.pdf	logos/pdf_icon.png
6	╨а╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╛	╨Ф╨╛╨║╤Г╨╝╨╡╨╜╤В╨░╤Ж╨╕╤П ╨▓╨╕╤Е╤А╨╡╨▓╨╛╨╣ ╨▓╤Л╤Б╨╛╨║╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П.pdf	logos/pdf_icon.png
7	╨а╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╛	╨Ф╨╛╨║╤Г╨╝╨╡╨╜╤В╨░╤Ж╨╕╤П ╨▓╨╕╤Е╤А╨╡╨▓╨╛╨╣ ╤А╨░╤Б╤Е╨╛╨┤╨╛╨╝╨╡╤А.pdf	logos/pdf_icon.png
8	╨а╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╛	╨н╨╗╨╡╨║╤В╤А╨╛╨╝╨░╨│╨╜╨╕╤В╨╜╤Л╨╣ ╤А╨░╤Б╤Е╨╛.pdf	logos/pdf_icon.png
9	╨а╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╛	╨г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А ╤А╨░╨┤╨░╤А╨╜╤Л╨╣.pdf	logos/pdf_icon.png
10	╨а╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╛	╨г╤А╨╛╨▓╨╜╨╡╨╝╨╡╤А ╨▓╨╛╨╗╨╜╨╛╨▓╨╛╨┤╨╜╤Л╨╣.pdf	logos/pdf_icon.png
\.


--
-- Data for Name: schema_migrations; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.schema_migrations (version, dirty) FROM stdin;
3	f
\.


--
-- Data for Name: spec; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.spec (id, item_id, item_patch, name) FROM stdin;
\.


--
-- Data for Name: user_applications; Type: TABLE DATA; Schema: public; Owner: root
--

COPY public.user_applications (id, user_id, email, first_name, second_name, login, phone_number, company, address, city, order_date, items, order_status) FROM stdin;
1	2	testUser@gmail.com	╨Э╨Ш╨Ъ╨Ш╨в╨Ю╨б	╨Э╨Ш╨Ъ╨Ш╨в╨Ю╨б	AdminUser	89094882121	mmk	╨┤╨╛╨╝╨╡╨╜╤Й╨╕╨║╨╛╨▓	╨╝╨░╨│╨╜╨╕╤В╨║╨░	2026-07-02	[{"id": 2, "name": "╨Ь╨Ч╨Ь-╨Ф╨Ф1 ╨Ф╨╕╤Д╤Д╨╡╤А╨╡╨╜╤Ж╨╕╨░╨╗╤М╨╜╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П", "count": 4, "price": 30000, "props": {"╨Т╨╖╤А╤Л╨▓╨╛╨╖╨░╤Й╨╕╤В╨░": "1Ex d ia IIC T6тАжT4 Gb X", "╨Я╨╛╨│╤А╨╡╤И╨╜╨╛╤Б╤В╤М, %": "0.065", "╨Т╨╕╨▒╤А╨╛╤Б╤В╨╛╨╣╨║╨╛╤Б╤В╤М": "V2", "╨Я╤Л╨╗╨╡╨▓╨╗╨░╨│╨╛╨╖╨░╤Й╨╕╤В╨░": "IP65", "╨б╨┐╨╡╤Ж. ╨╕╤Б╨┐╨╛╨╗╨╜╨╡╨╜╨╕╨╡": "╨Т╤Л╤Б╨╛╨║╨╛╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨╜╨╛╨╡", "╨Т╤Л╤Е╨╛╨┤╨╜╤Л╨╡ ╤Б╨╕╨│╨╜╨░╨╗╤Л": "4-20╨╝╨Р + HART ╤Б ╨╜╨░╨╗╨╕╤З╨╕╨╡╨╝ DD", "╨Ш╨╖╨╝╨╡╤А╤П╨╡╨╝╨░╤П ╤Б╤А╨╡╨┤╨░": "╨Ц╨╕╨┤╨║╨╛╤Б╤В╤М", "╨Ч╨░╨┐╨╛╨╗╨╜╤П╤О╤Й╨░╤П ╨╢╨╕╨┤╨║╨╛╤Б╤В╤М": "╨б╨╕╨╗╨╕╨║╨╛╨╜╨╛╨▓╨╛╨╡ ╨╝╨░╤Б╨╗╨╛", "╨Э╨░╨┐╤А╤П╨╢╨╡╨╜╨╕╨╡ ╨┐╨╕╤В╨░╨╜╨╕╤П, ╨Т": "10.5...45", "╨Ф╨╕╨░╨┐╨░╨╖╨╛╨╜ ╨┐╨╡╤А╨╡╨╜╨░╤Б╤В╤А╨╛╨╣╨║╨╕": "╨┤╨╛ 100:1", "╨Ь╨╡╨╢╨┐╨╛╨▓╨╡╤А╨╛╤З╨╜╤Л╨╣ ╨╕╨╜╤В╨╡╤А╨▓╨░╨╗": "6 ╨╗╨╡╤В", "╨а╨░╨▒╨╛╤З╨░╤П ╤В╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░, ┬░╨б": "-120...+700", "╨Ь╨░╤В╨╡╤А╨╕╨░╨╗ ╨╝╨╡╨╝╨▒╤А╨░╨╜╤Л ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨░": "╨Э╨╡╤А╨╢╨░╨▓╨╡╤О╤Й╨░╤П ╤Б╤В╨░╨╗╤М 316L", "╨Ф╨╛╨╗╨│╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨░╤П ╤Б╤В╨░╨▒╨╕╨╗╤М╨╜╨╛╤Б╤В╤М": "╨Э╨╡ ╨▒╨╛╨╗╨╡╨╡ 0", "╨в╨╡╤Е╨╜╨╛╨╗╨╛╨│╨╕╤З╨╡╤Б╨║╨╛╨╡ ╨┐╤А╨╕╤Б╨╛╨╡╨┤╨╕╨╜╨╡╨╜╨╕╨╡": "╨Ь44╤Е1.25", "╨в╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л, ┬░╨б": "-90...+230 (╤Б ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╨╡╨╝ ╤Б╤А╨╡╨┤)", "╨в╨╡╨╝╨┐╨╡╤А╨░╤В╤Г╤А╨░ ╨╛╨║╤А╤Г╨╢╨░╤О╤Й╨╡╨╣ ╤Б╤А╨╡╨┤╤Л, ┬░╨б": "-60..+85", "╨Ь╨░╤В╨╡╤А╨╕╨░╨╗ ╨║╨╛╤А╨┐╤Г╤Б╨░ ╤Н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╨╛╨│╨╛ ╨▒╨╗╨╛╨║╨░": "╨Р╨╗╤О╨╝╨╕╨╜╨╕╨╣", "╨Ф╨╕╨░╨┐╨░╨╖╨╛╨╜ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╤Л╤Е ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╣ (╨╝╨╕╨╜, ╨╝╨░╨║╤Б), ╨Ь╨Я╨░": "0..40"}, "item_id": 1, "item_type": "╨Ф╨░╤В╤З╨╕╨║ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П", "item_article": "9823", "item_picture": "╨Ф╨░╤В╤З╨╕╨║ ╨┤╨╕╤Д╤Д╨╡╤А╨╡╨╜╤Ж╨╕╨░╨╗╤М╨╜╨╛╨│╨╛ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П.png", "item_spec_id": 0, "item_description": "╨Ф╨░╨╜╨╜╤Л╨╡ ╨┐╤А╨╕╨▒╨╛╤А╤Л ╨╕╨╖╨╝╨╡╤А╤П╤О╤В ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡ ╨▓ ╤В╤А╤Г╨▒╨░╤Е, ╤Б╨╛╤Б╤Г╨┤╨░╤Е, ╨░╨┐╨┐╨░╤А╨░╤В╨░╤Е, ╨┐╨░╤А╨╛╨▓╤Л╤Е ╨╕ ╨▓╨╛╨┤╨╛╨│╤А╨╡╨╣╨╜╤Л╤Е ╨║╨╛╤В╨╗╨░╤Е, ╨▓ ╨║╨░╤З╨╡╤Б╤В╨▓╨╡ ╤В╨╛╤З╨║╨╕ ╨╛╤В╤Б╤З╨╡╤В╨░ ╨┐╤А╨╕ ╤Н╤В╨╛╨╝ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╤В╤Б╤П ╨┤╨░╨▓╨╗╨╡╨╜╨╕╤П ╤А╨░╨▓╨╜╨╛╨│╨╛ ╨░╨▒╤Б╨╛╨╗╤О╤В╨╜╨╛╨╝╤Г ╨╜╤Г╨╗╤О. ╨Ю╨▒╨╡╤Б╨┐╨╡╤З╨╕╨▓╨░╨╡╤В╤Б╤П ╤В╨░╨║╨╛╨╡ ╨╕╨╖╨╝╨╡╤А╨╡╨╜╨╕╨╡ ╨╜╨░╨╗╨╕╤З╨╕╨╡╨╝ ╤Б╨┐╨╡╤Ж╨╕╨░╨╗╤М╨╜╨╛╨╣ ╨║╨░╨╝╨╡╤А╤Л, ╨╕╨╖ ╨║╨╛╤В╨╛╤А╨╛╨╣ ╨┐╤А╨╕ ╨╕╨╖╨│╨╛╤В╨╛╨▓╨╗╨╡╨╜╨╕╨╕ ╨┐╤А╨╕╨▒╨╛╤А╨░ ╨╛╤В╨║╨░╤З╨╕╨▓╨░╨╡╤В╤Б╤П ╨▓╨╛╨╖╨┤╤Г╤Е. ╨н╤В╨░ ╨║╨░╨╝╨╡╤А╨░ ╤А╨░╤Б╨┐╨╛╨╗╨░╨│╨░╨╡╤В╤Б╤П ╨▓ ╨┐╨╛╨╗╨╛╤Б╤В╨╕ ╤Б╨╡╨╜╤Б╨╛╤А╨░, ╨░ ╤Б ╨┤╤А╤Г╨│╨╛╨╣ ╤Б╤В╨╛╤А╨╛╨╜╤Л ╨╜╨░ ╤З╤Г╨▓╤Б╤В╨▓╨╕╤В╨╡╨╗╤М╨╜╤Л╨╣ ╤Н╨╗╨╡╨╝╨╡╨╜╤В ╨▓╨╛╨╖╨┤╨╡╨╣╤Б╤В╨▓╤Г╨╡╤В ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╤Б╤А╨╡╨┤╤Л. ╨н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╤Л╨╣ ╨▒╨╗╨╛╨║ ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В ╤А╨░╤Б╤З╨╡╤В ╨╕ ╨▓╤Л╨▓╨╛╨┤╨╕╤В ╨┐╨╛╨╗╤Г╤З╨╡╨╜╨╜╨╛╨╡ ╨╖╨╜╨░╤З╨╡╨╜╨╕╨╡ ╨╜╨░ ╨┤╨╕╤Б╨┐╨╗╨╡╨╣ ╨╕╨╗╨╕ ╨┐╨╡╤А╨╡╨┤╨░╨╡╤В ╤Б ╨┐╨╛╨╝╨╛╤Й╤М╤О ╨▓╤Л╤Е╨╛╨┤╨╜╤Л╤Е ╤Б╨╕╨│╨╜╨░╨╗╨╛╨▓.\\r\\n\\r\\n╨з╤Г╨▓╤Б╤В╨▓╨╕╤В╨╡╨╗╤М╨╜╤Л╨╝ ╤Н╨╗╨╡╨╝╨╡╨╜╤В╨╛╨╝ ╤Б╨╗╤Г╨╢╨╕╤В ╨╝╨╛╨╜╨╛╨║╤А╨╕╤Б╤В╨░╨╗╨╗╨╕╤З╨╡╤Б╨║╨░╤П ╨║╤А╨╡╨╝╨╜╨╕╨╡╨▓╨░╤П ╨╝╨╡╨╝╨▒╤А╨░╨╜╨░, ╨╜╨░ ╨║╨╛╤В╨╛╤А╨╛╨╣ ╤А╨░╤Б╨┐╨╛╨╗╨╛╨╢╨╡╨╜ ╨╝╨╛╤Б╤В ╨г╨╕╤В╤Б╤В╨╛╨╜╨░, ╨┐╨╗╨╡╤З╨╕ ╨╝╨╛╤Б╤В╨░ - ╨┐╤М╨╡╨╖╨╛╤А╨╡╨╖╨╕╤Б╤В╨╛╤А╤Л. ╨Ф╨╗╤П ╨╖╨░╤Й╨╕╤В╤Л ╤Б╨╡╨╜╤Б╨╛╤А╨░ ╨╛╤В ╨▓╨╛╨╖╨┤╨╡╨╣╤Б╤В╨▓╨╕╤П ╨░╨│╤А╨╡╤Б╤Б╨╕╨▓╨╜╨╛╨╣ ╨╕╨╖╨╝╨╡╤А╤П╨╡╨╝╨╛╨╣ ╨╕ ╨╛╨║╤А╤Г╨╢╨░╤О╤Й╨╕╤Е ╤Б╤А╨╡╨┤, ╨▓ ╨╛╤В╨┤╨╡╨╗╤М╨╜╤Л╤Е ╨╝╨╛╨┤╨╕╤Д╨╕╨║╨░╤Ж╨╕╤П╤Е ╨┐╤А╨╡╨┤╤Г╤Б╨╝╨╛╤В╤А╨╡╨╜╤Л ╤А╨░╨╖╨┤╨╡╨╗╨╕╤В╨╡╨╗╤М╨╜╤Л╨╡ ╨╝╨╡╨╝╨▒╤А╨░╨╜╤Л ╨╕ ╨╖╨░╨┐╨╛╨╗╨╜╤П╤О╤Й╨░╤П ╨╢╨╕╨┤╨║╨╛╤Б╤В╤М. ╨Я╤А╨╕ ╤Н╤В╨╛╨╝ ╨╡╤Б╤В╤М ╨▓╨╛╨╖╨╝╨╛╨╢╨╜╨╛╤Б╤В╤М ╨▓╤Л╨▒╤А╨░╤В╤М ╤В╨╕╨┐ ╨╖╨░╨┐╨╛╨╗╨╜╤П╤О╤Й╨╡╨╣ ╨╢╨╕╨┤╨║╨╛╤Б╤В╨╕ ╨╕ ╨╝╨░╤В╨╡╤А╨╕╨░╨╗╤Л ╨╝╨╡╨╝╨▒╤А╨░╨╜╤Л. ╨Т ╤А╤Г╨║╨╛╨▓╨╛╨┤╤Б╤В╨▓╨╡ ╨┐╨╛ ╤Н╨║╤Б╨┐╨╗╤Г╨░╤В╨░╤Ж╨╕╨╕ ╨┐╤А╨╛╨┐╨╕╤Б╨░╨╜╤Л ╨▓╤Б╨╡ ╨▓╨░╤А╨╕╨░╨╜╤В╤Л ╨╕╨╖╨│╨╛╤В╨╛╨▓╨╗╨╡╨╜╨╕╤П, ╨▓ ╤В╨╛╨╝ ╤З╨╕╤Б╨╗╨╡ ╤Н╨╗╨╡╨║╤В╤А╨╛╨╜╨╜╨╛╨│╨╛ ╨▒╨╗╨╛╨║╨░ ╨╕ ╨║╨╛╤А╨┐╤Г╤Б╨░ ╨┐╤А╨╕╨▒╨╛╤А╨╛╨▓ ╤Б ╤Г╤З╨╡╤В╨╛╨╝ ╤Г╤Б╨╗╨╛╨▓╨╕╨╣ ╤Н╨║╤Б╨┐╨╗╤Г╨░╤В╨░╤Ж╨╕╨╕.", "item_secondary_type": "╨Ф╨╕╤Д╤Д╨╡╤А╨╡╨╜╤Ж╨╕╨░╨╗╤М╨╜╨╛╨╡ ╨┤╨░╨▓╨╗╨╡╨╜╨╕╨╡"}]	╨Ю╤В╨╝╨╡╨╜╨╡╨╜
\.


--
-- Name: customer_id_seq; Type: SEQUENCE SET; Schema: public; Owner: root
--

SELECT pg_catalog.setval('public.customer_id_seq', 3, true);


--
-- Name: item_id_seq; Type: SEQUENCE SET; Schema: public; Owner: root
--

SELECT pg_catalog.setval('public.item_id_seq', 11, true);


--
-- Name: item_properties_id_seq; Type: SEQUENCE SET; Schema: public; Owner: root
--

SELECT pg_catalog.setval('public.item_properties_id_seq', 24, true);


--
-- Name: spec_id_seq; Type: SEQUENCE SET; Schema: public; Owner: root
--

SELECT pg_catalog.setval('public.spec_id_seq', 1, false);


--
-- Name: user_applications_id_seq; Type: SEQUENCE SET; Schema: public; Owner: root
--

SELECT pg_catalog.setval('public.user_applications_id_seq', 1, true);


--
-- Name: customer customer_email_key; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.customer
    ADD CONSTRAINT customer_email_key UNIQUE (email);


--
-- Name: customer customer_login_key; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.customer
    ADD CONSTRAINT customer_login_key UNIQUE (login);


--
-- Name: customer customer_pkey; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.customer
    ADD CONSTRAINT customer_pkey PRIMARY KEY (id);


--
-- Name: item item_name_key; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item
    ADD CONSTRAINT item_name_key UNIQUE (name);


--
-- Name: item item_pkey; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item
    ADD CONSTRAINT item_pkey PRIMARY KEY (id);


--
-- Name: item_properties item_properties_pkey; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item_properties
    ADD CONSTRAINT item_properties_pkey PRIMARY KEY (id);


--
-- Name: item_properties_values item_properties_values_pkey; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item_properties_values
    ADD CONSTRAINT item_properties_values_pkey PRIMARY KEY (item_id, property_id);


--
-- Name: item_spec_files item_spec_files_pkey; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item_spec_files
    ADD CONSTRAINT item_spec_files_pkey PRIMARY KEY (id);


--
-- Name: schema_migrations schema_migrations_pkey; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.schema_migrations
    ADD CONSTRAINT schema_migrations_pkey PRIMARY KEY (version);


--
-- Name: spec spec_item_patch_key; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.spec
    ADD CONSTRAINT spec_item_patch_key UNIQUE (item_patch);


--
-- Name: spec spec_name_key; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.spec
    ADD CONSTRAINT spec_name_key UNIQUE (name);


--
-- Name: spec spec_pkey; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.spec
    ADD CONSTRAINT spec_pkey PRIMARY KEY (id);


--
-- Name: user_applications user_applications_pkey; Type: CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.user_applications
    ADD CONSTRAINT user_applications_pkey PRIMARY KEY (id);


--
-- Name: customer_delivery_info customer_delivery_info_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.customer_delivery_info
    ADD CONSTRAINT customer_delivery_info_id_fkey FOREIGN KEY (id) REFERENCES public.customer(id);


--
-- Name: customer_item customer_item_customer_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.customer_item
    ADD CONSTRAINT customer_item_customer_id_fkey FOREIGN KEY (customer_id) REFERENCES public.customer(id);


--
-- Name: customer_item customer_item_item_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.customer_item
    ADD CONSTRAINT customer_item_item_id_fkey FOREIGN KEY (item_id) REFERENCES public.item(id) ON DELETE CASCADE;


--
-- Name: customer_personal_info customer_personal_info_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.customer_personal_info
    ADD CONSTRAINT customer_personal_info_id_fkey FOREIGN KEY (id) REFERENCES public.customer(id);


--
-- Name: item_properties_values item_properties_values_item_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item_properties_values
    ADD CONSTRAINT item_properties_values_item_id_fkey FOREIGN KEY (item_id) REFERENCES public.item(id) ON DELETE CASCADE;


--
-- Name: item_properties_values item_properties_values_property_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item_properties_values
    ADD CONSTRAINT item_properties_values_property_id_fkey FOREIGN KEY (property_id) REFERENCES public.item_properties(id);


--
-- Name: item_spec_files item_spec_files_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.item_spec_files
    ADD CONSTRAINT item_spec_files_id_fkey FOREIGN KEY (id) REFERENCES public.item(id) ON DELETE CASCADE;


--
-- Name: spec spec_item_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.spec
    ADD CONSTRAINT spec_item_id_fkey FOREIGN KEY (item_id) REFERENCES public.item(id) ON DELETE CASCADE;


--
-- Name: user_applications user_applications_user_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: root
--

ALTER TABLE ONLY public.user_applications
    ADD CONSTRAINT user_applications_user_id_fkey FOREIGN KEY (user_id) REFERENCES public.customer(id);


--
-- PostgreSQL database dump complete
--

\unrestrict pryhRZchLWn5Jqp4afwC5wsaElgaLgmZVQ5V083939wgfyaK1IpYbNsvihkgfTN

--
-- Database "root" dump
--

--
-- PostgreSQL database dump
--

\restrict VAt2JnYBayyTPx0mRNXz4MC78l5x4C75eslX2VvmcWrBol1YWHbrZLyD6GPEfai

-- Dumped from database version 14.23
-- Dumped by pg_dump version 14.23

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Name: root; Type: DATABASE; Schema: -; Owner: root
--

CREATE DATABASE root WITH TEMPLATE = template0 ENCODING = 'UTF8' LOCALE = 'en_US.utf8';


ALTER DATABASE root OWNER TO root;

\unrestrict VAt2JnYBayyTPx0mRNXz4MC78l5x4C75eslX2VvmcWrBol1YWHbrZLyD6GPEfai
\connect root
\restrict VAt2JnYBayyTPx0mRNXz4MC78l5x4C75eslX2VvmcWrBol1YWHbrZLyD6GPEfai

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- PostgreSQL database dump complete
--

\unrestrict VAt2JnYBayyTPx0mRNXz4MC78l5x4C75eslX2VvmcWrBol1YWHbrZLyD6GPEfai

--
-- PostgreSQL database cluster dump complete
--

